/* automatically generated by rust-bindgen 0.72.1 */

pub const RAYGUI_VERSION_MAJOR: u32 = 4;
pub const RAYGUI_VERSION_MINOR: u32 = 5;
pub const RAYGUI_VERSION_PATCH: u32 = 0;
pub const RAYGUI_VERSION: &[u8; 8] = b"5.0-dev\0";
pub const RAYLIB_VERSION_MAJOR: u32 = 6;
pub const RAYLIB_VERSION_MINOR: u32 = 0;
pub const RAYLIB_VERSION_PATCH: u32 = 0;
pub const RAYLIB_VERSION: &[u8; 4] = b"6.0\0";
pub const PI: f64 = 3.141592653589793;
pub const DEG2RAD: f64 = 0.017453292519943295;
pub const RAD2DEG: f64 = 57.29577951308232;
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const SCROLLBAR_LEFT_SIDE: u32 = 0;
pub const SCROLLBAR_RIGHT_SIDE: u32 = 1;
pub const EPSILON: f64 = 0.000001;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_CXX26: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;

pub const RL_TEXTURE_WRAP_MIRROR_CLAMP: u32 = 34626;
pub const RL_MODELVIEW: u32 = 5888;
pub const RL_PROJECTION: u32 = 5889;
pub const RL_TEXTURE: u32 = 5890;
pub const RL_LINES: u32 = 1;
pub const RL_TRIANGLES: u32 = 4;
pub const RL_QUADS: u32 = 7;
pub const RL_UNSIGNED_BYTE: u32 = 5121;
pub const RL_FLOAT: u32 = 5126;
pub const RL_STREAM_DRAW: u32 = 35040;
pub const RL_STREAM_READ: u32 = 35041;
pub const RL_STREAM_COPY: u32 = 35042;
pub const RL_STATIC_DRAW: u32 = 35044;
pub const RL_STATIC_READ: u32 = 35045;
pub const RL_STATIC_COPY: u32 = 35046;
pub const RL_DYNAMIC_DRAW: u32 = 35048;
pub const RL_DYNAMIC_READ: u32 = 35049;
pub const RL_DYNAMIC_COPY: u32 = 35050;
pub const RL_FRAGMENT_SHADER: u32 = 35632;
pub const RL_VERTEX_SHADER: u32 = 35633;
pub const RL_COMPUTE_SHADER: u32 = 37305;
pub const RL_ZERO: u32 = 0;
pub const RL_ONE: u32 = 1;
pub const RL_SRC_COLOR: u32 = 768;
pub const RL_ONE_MINUS_SRC_COLOR: u32 = 769;
pub const RL_SRC_ALPHA: u32 = 770;
pub const RL_ONE_MINUS_SRC_ALPHA: u32 = 771;
pub const RL_DST_ALPHA: u32 = 772;
pub const RL_ONE_MINUS_DST_ALPHA: u32 = 773;
pub const RL_DST_COLOR: u32 = 774;
pub const RL_ONE_MINUS_DST_COLOR: u32 = 775;
pub const RL_SRC_ALPHA_SATURATE: u32 = 776;
pub const RL_CONSTANT_COLOR: u32 = 32769;
pub const RL_ONE_MINUS_CONSTANT_COLOR: u32 = 32770;
pub const RL_CONSTANT_ALPHA: u32 = 32771;
pub const RL_ONE_MINUS_CONSTANT_ALPHA: u32 = 32772;
pub const RL_FUNC_ADD: u32 = 32774;
pub const RL_MIN: u32 = 32775;
pub const RL_MAX: u32 = 32776;
pub const RL_FUNC_SUBTRACT: u32 = 32778;
pub const RL_FUNC_REVERSE_SUBTRACT: u32 = 32779;
pub const RL_BLEND_EQUATION: u32 = 32777;
pub const RL_BLEND_EQUATION_RGB: u32 = 32777;
pub const RL_BLEND_EQUATION_ALPHA: u32 = 34877;
pub const RL_BLEND_DST_RGB: u32 = 32968;
pub const RL_BLEND_SRC_RGB: u32 = 32969;
pub const RL_BLEND_DST_ALPHA: u32 = 32970;
pub const RL_BLEND_SRC_ALPHA: u32 = 32971;
pub const RL_BLEND_COLOR: u32 = 32773;
pub const RL_READ_FRAMEBUFFER: u32 = 36008;
pub const RL_DRAW_FRAMEBUFFER: u32 = 36009;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_POSITION: u32 = 0;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_TEXCOORD: u32 = 1;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_NORMAL: u32 = 2;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_COLOR: u32 = 3;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_TANGENT: u32 = 4;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_TEXCOORD2: u32 = 5;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_INDICES: u32 = 6;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_BONEINDICES: u32 = 7;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_BONEWEIGHTS: u32 = 8;
pub const RL_DEFAULT_SHADER_ATTRIB_LOCATION_INSTANCETRANSFORM: u32 = 9;
pub const CAMERA_CULL_DISTANCE_NEAR: f64 = 0.05;
pub const CAMERA_CULL_DISTANCE_FAR: f64 = 4000.0;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct Vector2 {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vector2"][::core::mem::size_of::<Vector2>() - 8usize];
    ["Alignment of Vector2"][::core::mem::align_of::<Vector2>() - 4usize];
    ["Offset of field: Vector2::x"][::core::mem::offset_of!(Vector2, x) - 0usize];
    ["Offset of field: Vector2::y"][::core::mem::offset_of!(Vector2, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct Vector3 {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vector3"][::core::mem::size_of::<Vector3>() - 12usize];
    ["Alignment of Vector3"][::core::mem::align_of::<Vector3>() - 4usize];
    ["Offset of field: Vector3::x"][::core::mem::offset_of!(Vector3, x) - 0usize];
    ["Offset of field: Vector3::y"][::core::mem::offset_of!(Vector3, y) - 4usize];
    ["Offset of field: Vector3::z"][::core::mem::offset_of!(Vector3, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct Vector4 {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vector4"][::core::mem::size_of::<Vector4>() - 16usize];
    ["Alignment of Vector4"][::core::mem::align_of::<Vector4>() - 4usize];
    ["Offset of field: Vector4::x"][::core::mem::offset_of!(Vector4, x) - 0usize];
    ["Offset of field: Vector4::y"][::core::mem::offset_of!(Vector4, y) - 4usize];
    ["Offset of field: Vector4::z"][::core::mem::offset_of!(Vector4, z) - 8usize];
    ["Offset of field: Vector4::w"][::core::mem::offset_of!(Vector4, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct Matrix {
    pub m0: f32,
    pub m4: f32,
    pub m8: f32,
    pub m12: f32,
    pub m1: f32,
    pub m5: f32,
    pub m9: f32,
    pub m13: f32,
    pub m2: f32,
    pub m6: f32,
    pub m10: f32,
    pub m14: f32,
    pub m3: f32,
    pub m7: f32,
    pub m11: f32,
    pub m15: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Matrix"][::core::mem::size_of::<Matrix>() - 64usize];
    ["Alignment of Matrix"][::core::mem::align_of::<Matrix>() - 4usize];
    ["Offset of field: Matrix::m0"][::core::mem::offset_of!(Matrix, m0) - 0usize];
    ["Offset of field: Matrix::m4"][::core::mem::offset_of!(Matrix, m4) - 4usize];
    ["Offset of field: Matrix::m8"][::core::mem::offset_of!(Matrix, m8) - 8usize];
    ["Offset of field: Matrix::m12"][::core::mem::offset_of!(Matrix, m12) - 12usize];
    ["Offset of field: Matrix::m1"][::core::mem::offset_of!(Matrix, m1) - 16usize];
    ["Offset of field: Matrix::m5"][::core::mem::offset_of!(Matrix, m5) - 20usize];
    ["Offset of field: Matrix::m9"][::core::mem::offset_of!(Matrix, m9) - 24usize];
    ["Offset of field: Matrix::m13"][::core::mem::offset_of!(Matrix, m13) - 28usize];
    ["Offset of field: Matrix::m2"][::core::mem::offset_of!(Matrix, m2) - 32usize];
    ["Offset of field: Matrix::m6"][::core::mem::offset_of!(Matrix, m6) - 36usize];
    ["Offset of field: Matrix::m10"][::core::mem::offset_of!(Matrix, m10) - 40usize];
    ["Offset of field: Matrix::m14"][::core::mem::offset_of!(Matrix, m14) - 44usize];
    ["Offset of field: Matrix::m3"][::core::mem::offset_of!(Matrix, m3) - 48usize];
    ["Offset of field: Matrix::m7"][::core::mem::offset_of!(Matrix, m7) - 52usize];
    ["Offset of field: Matrix::m11"][::core::mem::offset_of!(Matrix, m11) - 56usize];
    ["Offset of field: Matrix::m15"][::core::mem::offset_of!(Matrix, m15) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Image {
    pub data: *mut ::core::ffi::c_void,
    pub width: ::core::ffi::c_int,
    pub height: ::core::ffi::c_int,
    pub mipmaps: ::core::ffi::c_int,
    pub format: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Image"][::core::mem::size_of::<Image>() - 24usize];
    ["Alignment of Image"][::core::mem::align_of::<Image>() - 8usize];
    ["Offset of field: Image::data"][::core::mem::offset_of!(Image, data) - 0usize];
    ["Offset of field: Image::width"][::core::mem::offset_of!(Image, width) - 8usize];
    ["Offset of field: Image::height"][::core::mem::offset_of!(Image, height) - 12usize];
    ["Offset of field: Image::mipmaps"][::core::mem::offset_of!(Image, mipmaps) - 16usize];
    ["Offset of field: Image::format"][::core::mem::offset_of!(Image, format) - 20usize];
};
impl Default for Image {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct Texture {
    pub id: ::core::ffi::c_uint,
    pub width: ::core::ffi::c_int,
    pub height: ::core::ffi::c_int,
    pub mipmaps: ::core::ffi::c_int,
    pub format: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Texture"][::core::mem::size_of::<Texture>() - 20usize];
    ["Alignment of Texture"][::core::mem::align_of::<Texture>() - 4usize];
    ["Offset of field: Texture::id"][::core::mem::offset_of!(Texture, id) - 0usize];
    ["Offset of field: Texture::width"][::core::mem::offset_of!(Texture, width) - 4usize];
    ["Offset of field: Texture::height"][::core::mem::offset_of!(Texture, height) - 8usize];
    ["Offset of field: Texture::mipmaps"][::core::mem::offset_of!(Texture, mipmaps) - 12usize];
    ["Offset of field: Texture::format"][::core::mem::offset_of!(Texture, format) - 16usize];
};
pub type Texture2D = Texture;
pub type TextureCubemap = Texture;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct RenderTexture {
    pub id: ::core::ffi::c_uint,
    pub texture: Texture,
    pub depth: Texture,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RenderTexture"][::core::mem::size_of::<RenderTexture>() - 44usize];
    ["Alignment of RenderTexture"][::core::mem::align_of::<RenderTexture>() - 4usize];
    ["Offset of field: RenderTexture::id"][::core::mem::offset_of!(RenderTexture, id) - 0usize];
    ["Offset of field: RenderTexture::texture"]
        [::core::mem::offset_of!(RenderTexture, texture) - 4usize];
    ["Offset of field: RenderTexture::depth"]
        [::core::mem::offset_of!(RenderTexture, depth) - 24usize];
};
pub type RenderTexture2D = RenderTexture;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct NPatchInfo {
    pub source: Rectangle,
    pub left: ::core::ffi::c_int,
    pub top: ::core::ffi::c_int,
    pub right: ::core::ffi::c_int,
    pub bottom: ::core::ffi::c_int,
    pub layout: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NPatchInfo"][::core::mem::size_of::<NPatchInfo>() - 36usize];
    ["Alignment of NPatchInfo"][::core::mem::align_of::<NPatchInfo>() - 4usize];
    ["Offset of field: NPatchInfo::source"][::core::mem::offset_of!(NPatchInfo, source) - 0usize];
    ["Offset of field: NPatchInfo::left"][::core::mem::offset_of!(NPatchInfo, left) - 16usize];
    ["Offset of field: NPatchInfo::top"][::core::mem::offset_of!(NPatchInfo, top) - 20usize];
    ["Offset of field: NPatchInfo::right"][::core::mem::offset_of!(NPatchInfo, right) - 24usize];
    ["Offset of field: NPatchInfo::bottom"][::core::mem::offset_of!(NPatchInfo, bottom) - 28usize];
    ["Offset of field: NPatchInfo::layout"][::core::mem::offset_of!(NPatchInfo, layout) - 32usize];
};
impl Default for NPatchInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct GlyphInfo {
    pub value: ::core::ffi::c_int,
    pub offsetX: ::core::ffi::c_int,
    pub offsetY: ::core::ffi::c_int,
    pub advanceX: ::core::ffi::c_int,
    pub image: Image,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GlyphInfo"][::core::mem::size_of::<GlyphInfo>() - 40usize];
    ["Alignment of GlyphInfo"][::core::mem::align_of::<GlyphInfo>() - 8usize];
    ["Offset of field: GlyphInfo::value"][::core::mem::offset_of!(GlyphInfo, value) - 0usize];
    ["Offset of field: GlyphInfo::offsetX"][::core::mem::offset_of!(GlyphInfo, offsetX) - 4usize];
    ["Offset of field: GlyphInfo::offsetY"][::core::mem::offset_of!(GlyphInfo, offsetY) - 8usize];
    ["Offset of field: GlyphInfo::advanceX"]
        [::core::mem::offset_of!(GlyphInfo, advanceX) - 12usize];
    ["Offset of field: GlyphInfo::image"][::core::mem::offset_of!(GlyphInfo, image) - 16usize];
};
impl Default for GlyphInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Font {
    pub baseSize: ::core::ffi::c_int,
    pub glyphCount: ::core::ffi::c_int,
    pub glyphPadding: ::core::ffi::c_int,
    pub texture: Texture2D,
    pub recs: *mut Rectangle,
    pub glyphs: *mut GlyphInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Font"][::core::mem::size_of::<Font>() - 48usize];
    ["Alignment of Font"][::core::mem::align_of::<Font>() - 8usize];
    ["Offset of field: Font::baseSize"][::core::mem::offset_of!(Font, baseSize) - 0usize];
    ["Offset of field: Font::glyphCount"][::core::mem::offset_of!(Font, glyphCount) - 4usize];
    ["Offset of field: Font::glyphPadding"][::core::mem::offset_of!(Font, glyphPadding) - 8usize];
    ["Offset of field: Font::texture"][::core::mem::offset_of!(Font, texture) - 12usize];
    ["Offset of field: Font::recs"][::core::mem::offset_of!(Font, recs) - 32usize];
    ["Offset of field: Font::glyphs"][::core::mem::offset_of!(Font, glyphs) - 40usize];
};
impl Default for Font {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct Camera3D {
    pub position: Vector3,
    pub target: Vector3,
    pub up: Vector3,
    pub fovy: f32,
    pub projection: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Camera3D"][::core::mem::size_of::<Camera3D>() - 44usize];
    ["Alignment of Camera3D"][::core::mem::align_of::<Camera3D>() - 4usize];
    ["Offset of field: Camera3D::position"][::core::mem::offset_of!(Camera3D, position) - 0usize];
    ["Offset of field: Camera3D::target"][::core::mem::offset_of!(Camera3D, target) - 12usize];
    ["Offset of field: Camera3D::up"][::core::mem::offset_of!(Camera3D, up) - 24usize];
    ["Offset of field: Camera3D::fovy"][::core::mem::offset_of!(Camera3D, fovy) - 36usize];
    ["Offset of field: Camera3D::projection"]
        [::core::mem::offset_of!(Camera3D, projection) - 40usize];
};
pub type Camera = Camera3D;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct Camera2D {
    pub offset: Vector2,
    pub target: Vector2,
    pub rotation: f32,
    pub zoom: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Camera2D"][::core::mem::size_of::<Camera2D>() - 24usize];
    ["Alignment of Camera2D"][::core::mem::align_of::<Camera2D>() - 4usize];
    ["Offset of field: Camera2D::offset"][::core::mem::offset_of!(Camera2D, offset) - 0usize];
    ["Offset of field: Camera2D::target"][::core::mem::offset_of!(Camera2D, target) - 8usize];
    ["Offset of field: Camera2D::rotation"][::core::mem::offset_of!(Camera2D, rotation) - 16usize];
    ["Offset of field: Camera2D::zoom"][::core::mem::offset_of!(Camera2D, zoom) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Mesh {
    pub vertexCount: ::core::ffi::c_int,
    pub triangleCount: ::core::ffi::c_int,
    pub vertices: *mut f32,
    pub texcoords: *mut f32,
    pub texcoords2: *mut f32,
    pub normals: *mut f32,
    pub tangents: *mut f32,
    pub colors: *mut ::core::ffi::c_uchar,
    pub indices: *mut ::core::ffi::c_ushort,
    pub boneCount: ::core::ffi::c_int,
    pub boneIndices: *mut ::core::ffi::c_uchar,
    pub boneWeights: *mut f32,
    pub animVertices: *mut f32,
    pub animNormals: *mut f32,
    pub vaoId: ::core::ffi::c_uint,
    pub vboId: *mut ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Mesh"][::core::mem::size_of::<Mesh>() - 120usize];
    ["Alignment of Mesh"][::core::mem::align_of::<Mesh>() - 8usize];
    ["Offset of field: Mesh::vertexCount"][::core::mem::offset_of!(Mesh, vertexCount) - 0usize];
    ["Offset of field: Mesh::triangleCount"][::core::mem::offset_of!(Mesh, triangleCount) - 4usize];
    ["Offset of field: Mesh::vertices"][::core::mem::offset_of!(Mesh, vertices) - 8usize];
    ["Offset of field: Mesh::texcoords"][::core::mem::offset_of!(Mesh, texcoords) - 16usize];
    ["Offset of field: Mesh::texcoords2"][::core::mem::offset_of!(Mesh, texcoords2) - 24usize];
    ["Offset of field: Mesh::normals"][::core::mem::offset_of!(Mesh, normals) - 32usize];
    ["Offset of field: Mesh::tangents"][::core::mem::offset_of!(Mesh, tangents) - 40usize];
    ["Offset of field: Mesh::colors"][::core::mem::offset_of!(Mesh, colors) - 48usize];
    ["Offset of field: Mesh::indices"][::core::mem::offset_of!(Mesh, indices) - 56usize];
    ["Offset of field: Mesh::boneCount"][::core::mem::offset_of!(Mesh, boneCount) - 64usize];
    ["Offset of field: Mesh::boneIndices"][::core::mem::offset_of!(Mesh, boneIndices) - 72usize];
    ["Offset of field: Mesh::boneWeights"][::core::mem::offset_of!(Mesh, boneWeights) - 80usize];
    ["Offset of field: Mesh::animVertices"][::core::mem::offset_of!(Mesh, animVertices) - 88usize];
    ["Offset of field: Mesh::animNormals"][::core::mem::offset_of!(Mesh, animNormals) - 96usize];
    ["Offset of field: Mesh::vaoId"][::core::mem::offset_of!(Mesh, vaoId) - 104usize];
    ["Offset of field: Mesh::vboId"][::core::mem::offset_of!(Mesh, vboId) - 112usize];
};
impl Default for Mesh {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Shader {
    pub id: ::core::ffi::c_uint,
    pub locs: *mut ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Shader"][::core::mem::size_of::<Shader>() - 16usize];
    ["Alignment of Shader"][::core::mem::align_of::<Shader>() - 8usize];
    ["Offset of field: Shader::id"][::core::mem::offset_of!(Shader, id) - 0usize];
    ["Offset of field: Shader::locs"][::core::mem::offset_of!(Shader, locs) - 8usize];
};
impl Default for Shader {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct MaterialMap {
    pub texture: Texture2D,
    pub color: Color,
    pub value: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MaterialMap"][::core::mem::size_of::<MaterialMap>() - 28usize];
    ["Alignment of MaterialMap"][::core::mem::align_of::<MaterialMap>() - 4usize];
    ["Offset of field: MaterialMap::texture"]
        [::core::mem::offset_of!(MaterialMap, texture) - 0usize];
    ["Offset of field: MaterialMap::color"][::core::mem::offset_of!(MaterialMap, color) - 20usize];
    ["Offset of field: MaterialMap::value"][::core::mem::offset_of!(MaterialMap, value) - 24usize];
};
impl Default for MaterialMap {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Material {
    pub shader: Shader,
    pub maps: *mut MaterialMap,
    pub params: [f32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Material"][::core::mem::size_of::<Material>() - 40usize];
    ["Alignment of Material"][::core::mem::align_of::<Material>() - 8usize];
    ["Offset of field: Material::shader"][::core::mem::offset_of!(Material, shader) - 0usize];
    ["Offset of field: Material::maps"][::core::mem::offset_of!(Material, maps) - 16usize];
    ["Offset of field: Material::params"][::core::mem::offset_of!(Material, params) - 24usize];
};
impl Default for Material {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Transform {
    pub translation: Vector3,
    pub rotation: Quaternion,
    pub scale: Vector3,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Transform"][::core::mem::size_of::<Transform>() - 40usize];
    ["Alignment of Transform"][::core::mem::align_of::<Transform>() - 4usize];
    ["Offset of field: Transform::translation"]
        [::core::mem::offset_of!(Transform, translation) - 0usize];
    ["Offset of field: Transform::rotation"]
        [::core::mem::offset_of!(Transform, rotation) - 12usize];
    ["Offset of field: Transform::scale"][::core::mem::offset_of!(Transform, scale) - 28usize];
};
impl Default for Transform {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type ModelAnimPose = *mut Transform;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BoneInfo {
    pub name: [::core::ffi::c_char; 32usize],
    pub parent: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BoneInfo"][::core::mem::size_of::<BoneInfo>() - 36usize];
    ["Alignment of BoneInfo"][::core::mem::align_of::<BoneInfo>() - 4usize];
    ["Offset of field: BoneInfo::name"][::core::mem::offset_of!(BoneInfo, name) - 0usize];
    ["Offset of field: BoneInfo::parent"][::core::mem::offset_of!(BoneInfo, parent) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct ModelSkeleton {
    pub boneCount: ::core::ffi::c_int,
    pub bones: *mut BoneInfo,
    pub bindPose: ModelAnimPose,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ModelSkeleton"][::core::mem::size_of::<ModelSkeleton>() - 24usize];
    ["Alignment of ModelSkeleton"][::core::mem::align_of::<ModelSkeleton>() - 8usize];
    ["Offset of field: ModelSkeleton::boneCount"]
        [::core::mem::offset_of!(ModelSkeleton, boneCount) - 0usize];
    ["Offset of field: ModelSkeleton::bones"]
        [::core::mem::offset_of!(ModelSkeleton, bones) - 8usize];
    ["Offset of field: ModelSkeleton::bindPose"]
        [::core::mem::offset_of!(ModelSkeleton, bindPose) - 16usize];
};
impl Default for ModelSkeleton {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Model {
    pub transform: Matrix,
    pub meshCount: ::core::ffi::c_int,
    pub materialCount: ::core::ffi::c_int,
    pub meshes: *mut Mesh,
    pub materials: *mut Material,
    pub meshMaterial: *mut ::core::ffi::c_int,
    pub skeleton: ModelSkeleton,
    pub currentPose: ModelAnimPose,
    pub boneMatrices: *mut Matrix,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Model"][::core::mem::size_of::<Model>() - 136usize];
    ["Alignment of Model"][::core::mem::align_of::<Model>() - 8usize];
    ["Offset of field: Model::transform"][::core::mem::offset_of!(Model, transform) - 0usize];
    ["Offset of field: Model::meshCount"][::core::mem::offset_of!(Model, meshCount) - 64usize];
    ["Offset of field: Model::materialCount"]
        [::core::mem::offset_of!(Model, materialCount) - 68usize];
    ["Offset of field: Model::meshes"][::core::mem::offset_of!(Model, meshes) - 72usize];
    ["Offset of field: Model::materials"][::core::mem::offset_of!(Model, materials) - 80usize];
    ["Offset of field: Model::meshMaterial"]
        [::core::mem::offset_of!(Model, meshMaterial) - 88usize];
    ["Offset of field: Model::skeleton"][::core::mem::offset_of!(Model, skeleton) - 96usize];
    ["Offset of field: Model::currentPose"][::core::mem::offset_of!(Model, currentPose) - 120usize];
    ["Offset of field: Model::boneMatrices"]
        [::core::mem::offset_of!(Model, boneMatrices) - 128usize];
};
impl Default for Model {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct ModelAnimation {
    pub name: [::core::ffi::c_char; 32usize],
    pub boneCount: ::core::ffi::c_int,
    pub keyframeCount: ::core::ffi::c_int,
    pub keyframePoses: *mut ModelAnimPose,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ModelAnimation"][::core::mem::size_of::<ModelAnimation>() - 48usize];
    ["Alignment of ModelAnimation"][::core::mem::align_of::<ModelAnimation>() - 8usize];
    ["Offset of field: ModelAnimation::name"]
        [::core::mem::offset_of!(ModelAnimation, name) - 0usize];
    ["Offset of field: ModelAnimation::boneCount"]
        [::core::mem::offset_of!(ModelAnimation, boneCount) - 32usize];
    ["Offset of field: ModelAnimation::keyframeCount"]
        [::core::mem::offset_of!(ModelAnimation, keyframeCount) - 36usize];
    ["Offset of field: ModelAnimation::keyframePoses"]
        [::core::mem::offset_of!(ModelAnimation, keyframePoses) - 40usize];
};
impl Default for ModelAnimation {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct Ray {
    pub position: Vector3,
    pub direction: Vector3,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Ray"][::core::mem::size_of::<Ray>() - 24usize];
    ["Alignment of Ray"][::core::mem::align_of::<Ray>() - 4usize];
    ["Offset of field: Ray::position"][::core::mem::offset_of!(Ray, position) - 0usize];
    ["Offset of field: Ray::direction"][::core::mem::offset_of!(Ray, direction) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct RayCollision {
    pub hit: bool,
    pub distance: f32,
    pub point: Vector3,
    pub normal: Vector3,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RayCollision"][::core::mem::size_of::<RayCollision>() - 32usize];
    ["Alignment of RayCollision"][::core::mem::align_of::<RayCollision>() - 4usize];
    ["Offset of field: RayCollision::hit"][::core::mem::offset_of!(RayCollision, hit) - 0usize];
    ["Offset of field: RayCollision::distance"]
        [::core::mem::offset_of!(RayCollision, distance) - 4usize];
    ["Offset of field: RayCollision::point"][::core::mem::offset_of!(RayCollision, point) - 8usize];
    ["Offset of field: RayCollision::normal"]
        [::core::mem::offset_of!(RayCollision, normal) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BoundingBox {
    pub min: Vector3,
    pub max: Vector3,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BoundingBox"][::core::mem::size_of::<BoundingBox>() - 24usize];
    ["Alignment of BoundingBox"][::core::mem::align_of::<BoundingBox>() - 4usize];
    ["Offset of field: BoundingBox::min"][::core::mem::offset_of!(BoundingBox, min) - 0usize];
    ["Offset of field: BoundingBox::max"][::core::mem::offset_of!(BoundingBox, max) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Wave {
    pub frameCount: ::core::ffi::c_uint,
    pub sampleRate: ::core::ffi::c_uint,
    pub sampleSize: ::core::ffi::c_uint,
    pub channels: ::core::ffi::c_uint,
    pub data: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Wave"][::core::mem::size_of::<Wave>() - 24usize];
    ["Alignment of Wave"][::core::mem::align_of::<Wave>() - 8usize];
    ["Offset of field: Wave::frameCount"][::core::mem::offset_of!(Wave, frameCount) - 0usize];
    ["Offset of field: Wave::sampleRate"][::core::mem::offset_of!(Wave, sampleRate) - 4usize];
    ["Offset of field: Wave::sampleSize"][::core::mem::offset_of!(Wave, sampleSize) - 8usize];
    ["Offset of field: Wave::channels"][::core::mem::offset_of!(Wave, channels) - 12usize];
    ["Offset of field: Wave::data"][::core::mem::offset_of!(Wave, data) - 16usize];
};
impl Default for Wave {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rAudioBuffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rAudioProcessor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct AudioStream {
    pub buffer: *mut rAudioBuffer,
    pub processor: *mut rAudioProcessor,
    pub sampleRate: ::core::ffi::c_uint,
    pub sampleSize: ::core::ffi::c_uint,
    pub channels: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AudioStream"][::core::mem::size_of::<AudioStream>() - 32usize];
    ["Alignment of AudioStream"][::core::mem::align_of::<AudioStream>() - 8usize];
    ["Offset of field: AudioStream::buffer"][::core::mem::offset_of!(AudioStream, buffer) - 0usize];
    ["Offset of field: AudioStream::processor"]
        [::core::mem::offset_of!(AudioStream, processor) - 8usize];
    ["Offset of field: AudioStream::sampleRate"]
        [::core::mem::offset_of!(AudioStream, sampleRate) - 16usize];
    ["Offset of field: AudioStream::sampleSize"]
        [::core::mem::offset_of!(AudioStream, sampleSize) - 20usize];
    ["Offset of field: AudioStream::channels"]
        [::core::mem::offset_of!(AudioStream, channels) - 24usize];
};
impl Default for AudioStream {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Sound {
    pub stream: AudioStream,
    pub frameCount: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Sound"][::core::mem::size_of::<Sound>() - 40usize];
    ["Alignment of Sound"][::core::mem::align_of::<Sound>() - 8usize];
    ["Offset of field: Sound::stream"][::core::mem::offset_of!(Sound, stream) - 0usize];
    ["Offset of field: Sound::frameCount"][::core::mem::offset_of!(Sound, frameCount) - 32usize];
};
impl Default for Sound {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct Music {
    pub stream: AudioStream,
    pub frameCount: ::core::ffi::c_uint,
    pub looping: bool,
    pub ctxType: ::core::ffi::c_int,
    pub ctxData: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Music"][::core::mem::size_of::<Music>() - 56usize];
    ["Alignment of Music"][::core::mem::align_of::<Music>() - 8usize];
    ["Offset of field: Music::stream"][::core::mem::offset_of!(Music, stream) - 0usize];
    ["Offset of field: Music::frameCount"][::core::mem::offset_of!(Music, frameCount) - 32usize];
    ["Offset of field: Music::looping"][::core::mem::offset_of!(Music, looping) - 36usize];
    ["Offset of field: Music::ctxType"][::core::mem::offset_of!(Music, ctxType) - 40usize];
    ["Offset of field: Music::ctxData"][::core::mem::offset_of!(Music, ctxData) - 48usize];
};
impl Default for Music {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct VrDeviceInfo {
    pub hResolution: ::core::ffi::c_int,
    pub vResolution: ::core::ffi::c_int,
    pub hScreenSize: f32,
    pub vScreenSize: f32,
    pub eyeToScreenDistance: f32,
    pub lensSeparationDistance: f32,
    pub interpupillaryDistance: f32,
    pub lensDistortionValues: [f32; 4usize],
    pub chromaAbCorrection: [f32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VrDeviceInfo"][::core::mem::size_of::<VrDeviceInfo>() - 60usize];
    ["Alignment of VrDeviceInfo"][::core::mem::align_of::<VrDeviceInfo>() - 4usize];
    ["Offset of field: VrDeviceInfo::hResolution"]
        [::core::mem::offset_of!(VrDeviceInfo, hResolution) - 0usize];
    ["Offset of field: VrDeviceInfo::vResolution"]
        [::core::mem::offset_of!(VrDeviceInfo, vResolution) - 4usize];
    ["Offset of field: VrDeviceInfo::hScreenSize"]
        [::core::mem::offset_of!(VrDeviceInfo, hScreenSize) - 8usize];
    ["Offset of field: VrDeviceInfo::vScreenSize"]
        [::core::mem::offset_of!(VrDeviceInfo, vScreenSize) - 12usize];
    ["Offset of field: VrDeviceInfo::eyeToScreenDistance"]
        [::core::mem::offset_of!(VrDeviceInfo, eyeToScreenDistance) - 16usize];
    ["Offset of field: VrDeviceInfo::lensSeparationDistance"]
        [::core::mem::offset_of!(VrDeviceInfo, lensSeparationDistance) - 20usize];
    ["Offset of field: VrDeviceInfo::interpupillaryDistance"]
        [::core::mem::offset_of!(VrDeviceInfo, interpupillaryDistance) - 24usize];
    ["Offset of field: VrDeviceInfo::lensDistortionValues"]
        [::core::mem::offset_of!(VrDeviceInfo, lensDistortionValues) - 28usize];
    ["Offset of field: VrDeviceInfo::chromaAbCorrection"]
        [::core::mem::offset_of!(VrDeviceInfo, chromaAbCorrection) - 44usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct VrStereoConfig {
    pub projection: [Matrix; 2usize],
    pub viewOffset: [Matrix; 2usize],
    pub leftLensCenter: [f32; 2usize],
    pub rightLensCenter: [f32; 2usize],
    pub leftScreenCenter: [f32; 2usize],
    pub rightScreenCenter: [f32; 2usize],
    pub scale: [f32; 2usize],
    pub scaleIn: [f32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VrStereoConfig"][::core::mem::size_of::<VrStereoConfig>() - 304usize];
    ["Alignment of VrStereoConfig"][::core::mem::align_of::<VrStereoConfig>() - 4usize];
    ["Offset of field: VrStereoConfig::projection"]
        [::core::mem::offset_of!(VrStereoConfig, projection) - 0usize];
    ["Offset of field: VrStereoConfig::viewOffset"]
        [::core::mem::offset_of!(VrStereoConfig, viewOffset) - 128usize];
    ["Offset of field: VrStereoConfig::leftLensCenter"]
        [::core::mem::offset_of!(VrStereoConfig, leftLensCenter) - 256usize];
    ["Offset of field: VrStereoConfig::rightLensCenter"]
        [::core::mem::offset_of!(VrStereoConfig, rightLensCenter) - 264usize];
    ["Offset of field: VrStereoConfig::leftScreenCenter"]
        [::core::mem::offset_of!(VrStereoConfig, leftScreenCenter) - 272usize];
    ["Offset of field: VrStereoConfig::rightScreenCenter"]
        [::core::mem::offset_of!(VrStereoConfig, rightScreenCenter) - 280usize];
    ["Offset of field: VrStereoConfig::scale"]
        [::core::mem::offset_of!(VrStereoConfig, scale) - 288usize];
    ["Offset of field: VrStereoConfig::scaleIn"]
        [::core::mem::offset_of!(VrStereoConfig, scaleIn) - 296usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct FilePathList {
    pub count: ::core::ffi::c_uint,
    pub paths: *mut *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FilePathList"][::core::mem::size_of::<FilePathList>() - 16usize];
    ["Alignment of FilePathList"][::core::mem::align_of::<FilePathList>() - 8usize];
    ["Offset of field: FilePathList::count"][::core::mem::offset_of!(FilePathList, count) - 0usize];
    ["Offset of field: FilePathList::paths"][::core::mem::offset_of!(FilePathList, paths) - 8usize];
};
impl Default for FilePathList {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct AutomationEvent {
    pub frame: ::core::ffi::c_uint,
    pub type_: ::core::ffi::c_uint,
    pub params: [::core::ffi::c_int; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AutomationEvent"][::core::mem::size_of::<AutomationEvent>() - 24usize];
    ["Alignment of AutomationEvent"][::core::mem::align_of::<AutomationEvent>() - 4usize];
    ["Offset of field: AutomationEvent::frame"]
        [::core::mem::offset_of!(AutomationEvent, frame) - 0usize];
    ["Offset of field: AutomationEvent::type_"]
        [::core::mem::offset_of!(AutomationEvent, type_) - 4usize];
    ["Offset of field: AutomationEvent::params"]
        [::core::mem::offset_of!(AutomationEvent, params) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct AutomationEventList {
    pub capacity: ::core::ffi::c_uint,
    pub count: ::core::ffi::c_uint,
    pub events: *mut AutomationEvent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AutomationEventList"][::core::mem::size_of::<AutomationEventList>() - 16usize];
    ["Alignment of AutomationEventList"][::core::mem::align_of::<AutomationEventList>() - 8usize];
    ["Offset of field: AutomationEventList::capacity"]
        [::core::mem::offset_of!(AutomationEventList, capacity) - 0usize];
    ["Offset of field: AutomationEventList::count"]
        [::core::mem::offset_of!(AutomationEventList, count) - 4usize];
    ["Offset of field: AutomationEventList::events"]
        [::core::mem::offset_of!(AutomationEventList, events) - 8usize];
};
impl Default for AutomationEventList {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ConfigFlags {
    FLAG_VSYNC_HINT = 64,
    FLAG_FULLSCREEN_MODE = 2,
    FLAG_WINDOW_RESIZABLE = 4,
    FLAG_WINDOW_UNDECORATED = 8,
    FLAG_WINDOW_HIDDEN = 128,
    FLAG_WINDOW_MINIMIZED = 512,
    FLAG_WINDOW_MAXIMIZED = 1024,
    FLAG_WINDOW_UNFOCUSED = 2048,
    FLAG_WINDOW_TOPMOST = 4096,
    FLAG_WINDOW_ALWAYS_RUN = 256,
    FLAG_WINDOW_TRANSPARENT = 16,
    FLAG_WINDOW_HIGHDPI = 8192,
    FLAG_WINDOW_MOUSE_PASSTHROUGH = 16384,
    FLAG_BORDERLESS_WINDOWED_MODE = 32768,
    FLAG_MSAA_4X_HINT = 32,
    FLAG_INTERLACED_HINT = 65536,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum TraceLogLevel {
    LOG_ALL = 0,
    LOG_TRACE = 1,
    LOG_DEBUG = 2,
    LOG_INFO = 3,
    LOG_WARNING = 4,
    LOG_ERROR = 5,
    LOG_FATAL = 6,
    LOG_NONE = 7,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum KeyboardKey {
    KEY_NULL = 0,
    KEY_APOSTROPHE = 39,
    KEY_COMMA = 44,
    KEY_MINUS = 45,
    KEY_PERIOD = 46,
    KEY_SLASH = 47,
    KEY_ZERO = 48,
    KEY_ONE = 49,
    KEY_TWO = 50,
    KEY_THREE = 51,
    KEY_FOUR = 52,
    KEY_FIVE = 53,
    KEY_SIX = 54,
    KEY_SEVEN = 55,
    KEY_EIGHT = 56,
    KEY_NINE = 57,
    KEY_SEMICOLON = 59,
    KEY_EQUAL = 61,
    KEY_A = 65,
    KEY_B = 66,
    KEY_C = 67,
    KEY_D = 68,
    KEY_E = 69,
    KEY_F = 70,
    KEY_G = 71,
    KEY_H = 72,
    KEY_I = 73,
    KEY_J = 74,
    KEY_K = 75,
    KEY_L = 76,
    KEY_M = 77,
    KEY_N = 78,
    KEY_O = 79,
    KEY_P = 80,
    KEY_Q = 81,
    KEY_R = 82,
    KEY_S = 83,
    KEY_T = 84,
    KEY_U = 85,
    KEY_V = 86,
    KEY_W = 87,
    KEY_X = 88,
    KEY_Y = 89,
    KEY_Z = 90,
    KEY_LEFT_BRACKET = 91,
    KEY_BACKSLASH = 92,
    KEY_RIGHT_BRACKET = 93,
    KEY_GRAVE = 96,
    KEY_SPACE = 32,
    KEY_ESCAPE = 256,
    KEY_ENTER = 257,
    KEY_TAB = 258,
    KEY_BACKSPACE = 259,
    KEY_INSERT = 260,
    KEY_DELETE = 261,
    KEY_RIGHT = 262,
    KEY_LEFT = 263,
    KEY_DOWN = 264,
    KEY_UP = 265,
    KEY_PAGE_UP = 266,
    KEY_PAGE_DOWN = 267,
    KEY_HOME = 268,
    KEY_END = 269,
    KEY_CAPS_LOCK = 280,
    KEY_SCROLL_LOCK = 281,
    KEY_NUM_LOCK = 282,
    KEY_PRINT_SCREEN = 283,
    KEY_PAUSE = 284,
    KEY_F1 = 290,
    KEY_F2 = 291,
    KEY_F3 = 292,
    KEY_F4 = 293,
    KEY_F5 = 294,
    KEY_F6 = 295,
    KEY_F7 = 296,
    KEY_F8 = 297,
    KEY_F9 = 298,
    KEY_F10 = 299,
    KEY_F11 = 300,
    KEY_F12 = 301,
    KEY_LEFT_SHIFT = 340,
    KEY_LEFT_CONTROL = 341,
    KEY_LEFT_ALT = 342,
    KEY_LEFT_SUPER = 343,
    KEY_RIGHT_SHIFT = 344,
    KEY_RIGHT_CONTROL = 345,
    KEY_RIGHT_ALT = 346,
    KEY_RIGHT_SUPER = 347,
    KEY_KB_MENU = 348,
    KEY_KP_0 = 320,
    KEY_KP_1 = 321,
    KEY_KP_2 = 322,
    KEY_KP_3 = 323,
    KEY_KP_4 = 324,
    KEY_KP_5 = 325,
    KEY_KP_6 = 326,
    KEY_KP_7 = 327,
    KEY_KP_8 = 328,
    KEY_KP_9 = 329,
    KEY_KP_DECIMAL = 330,
    KEY_KP_DIVIDE = 331,
    KEY_KP_MULTIPLY = 332,
    KEY_KP_SUBTRACT = 333,
    KEY_KP_ADD = 334,
    KEY_KP_ENTER = 335,
    KEY_KP_EQUAL = 336,
    KEY_BACK = 4,
    KEY_MENU = 5,
    KEY_VOLUME_UP = 24,
    KEY_VOLUME_DOWN = 25,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MouseButton {
    MOUSE_BUTTON_LEFT = 0,
    MOUSE_BUTTON_RIGHT = 1,
    MOUSE_BUTTON_MIDDLE = 2,
    MOUSE_BUTTON_SIDE = 3,
    MOUSE_BUTTON_EXTRA = 4,
    MOUSE_BUTTON_FORWARD = 5,
    MOUSE_BUTTON_BACK = 6,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MouseCursor {
    MOUSE_CURSOR_DEFAULT = 0,
    MOUSE_CURSOR_ARROW = 1,
    MOUSE_CURSOR_IBEAM = 2,
    MOUSE_CURSOR_CROSSHAIR = 3,
    MOUSE_CURSOR_POINTING_HAND = 4,
    MOUSE_CURSOR_RESIZE_EW = 5,
    MOUSE_CURSOR_RESIZE_NS = 6,
    MOUSE_CURSOR_RESIZE_NWSE = 7,
    MOUSE_CURSOR_RESIZE_NESW = 8,
    MOUSE_CURSOR_RESIZE_ALL = 9,
    MOUSE_CURSOR_NOT_ALLOWED = 10,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GamepadButton {
    GAMEPAD_BUTTON_UNKNOWN = 0,
    GAMEPAD_BUTTON_LEFT_FACE_UP = 1,
    GAMEPAD_BUTTON_LEFT_FACE_RIGHT = 2,
    GAMEPAD_BUTTON_LEFT_FACE_DOWN = 3,
    GAMEPAD_BUTTON_LEFT_FACE_LEFT = 4,
    GAMEPAD_BUTTON_RIGHT_FACE_UP = 5,
    GAMEPAD_BUTTON_RIGHT_FACE_RIGHT = 6,
    GAMEPAD_BUTTON_RIGHT_FACE_DOWN = 7,
    GAMEPAD_BUTTON_RIGHT_FACE_LEFT = 8,
    GAMEPAD_BUTTON_LEFT_TRIGGER_1 = 9,
    GAMEPAD_BUTTON_LEFT_TRIGGER_2 = 10,
    GAMEPAD_BUTTON_RIGHT_TRIGGER_1 = 11,
    GAMEPAD_BUTTON_RIGHT_TRIGGER_2 = 12,
    GAMEPAD_BUTTON_MIDDLE_LEFT = 13,
    GAMEPAD_BUTTON_MIDDLE = 14,
    GAMEPAD_BUTTON_MIDDLE_RIGHT = 15,
    GAMEPAD_BUTTON_LEFT_THUMB = 16,
    GAMEPAD_BUTTON_RIGHT_THUMB = 17,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GamepadAxis {
    GAMEPAD_AXIS_LEFT_X = 0,
    GAMEPAD_AXIS_LEFT_Y = 1,
    GAMEPAD_AXIS_RIGHT_X = 2,
    GAMEPAD_AXIS_RIGHT_Y = 3,
    GAMEPAD_AXIS_LEFT_TRIGGER = 4,
    GAMEPAD_AXIS_RIGHT_TRIGGER = 5,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MaterialMapIndex {
    MATERIAL_MAP_ALBEDO = 0,
    MATERIAL_MAP_METALNESS = 1,
    MATERIAL_MAP_NORMAL = 2,
    MATERIAL_MAP_ROUGHNESS = 3,
    MATERIAL_MAP_OCCLUSION = 4,
    MATERIAL_MAP_EMISSION = 5,
    MATERIAL_MAP_HEIGHT = 6,
    MATERIAL_MAP_CUBEMAP = 7,
    MATERIAL_MAP_IRRADIANCE = 8,
    MATERIAL_MAP_PREFILTER = 9,
    MATERIAL_MAP_BRDF = 10,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ShaderLocationIndex {
    SHADER_LOC_VERTEX_POSITION = 0,
    SHADER_LOC_VERTEX_TEXCOORD01 = 1,
    SHADER_LOC_VERTEX_TEXCOORD02 = 2,
    SHADER_LOC_VERTEX_NORMAL = 3,
    SHADER_LOC_VERTEX_TANGENT = 4,
    SHADER_LOC_VERTEX_COLOR = 5,
    SHADER_LOC_MATRIX_MVP = 6,
    SHADER_LOC_MATRIX_VIEW = 7,
    SHADER_LOC_MATRIX_PROJECTION = 8,
    SHADER_LOC_MATRIX_MODEL = 9,
    SHADER_LOC_MATRIX_NORMAL = 10,
    SHADER_LOC_VECTOR_VIEW = 11,
    SHADER_LOC_COLOR_DIFFUSE = 12,
    SHADER_LOC_COLOR_SPECULAR = 13,
    SHADER_LOC_COLOR_AMBIENT = 14,
    SHADER_LOC_MAP_ALBEDO = 15,
    SHADER_LOC_MAP_METALNESS = 16,
    SHADER_LOC_MAP_NORMAL = 17,
    SHADER_LOC_MAP_ROUGHNESS = 18,
    SHADER_LOC_MAP_OCCLUSION = 19,
    SHADER_LOC_MAP_EMISSION = 20,
    SHADER_LOC_MAP_HEIGHT = 21,
    SHADER_LOC_MAP_CUBEMAP = 22,
    SHADER_LOC_MAP_IRRADIANCE = 23,
    SHADER_LOC_MAP_PREFILTER = 24,
    SHADER_LOC_MAP_BRDF = 25,
    SHADER_LOC_VERTEX_BONEIDS = 26,
    SHADER_LOC_VERTEX_BONEWEIGHTS = 27,
    SHADER_LOC_MATRIX_BONETRANSFORMS = 28,
    SHADER_LOC_VERTEX_INSTANCETRANSFORM = 29,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ShaderUniformDataType {
    SHADER_UNIFORM_FLOAT = 0,
    SHADER_UNIFORM_VEC2 = 1,
    SHADER_UNIFORM_VEC3 = 2,
    SHADER_UNIFORM_VEC4 = 3,
    SHADER_UNIFORM_INT = 4,
    SHADER_UNIFORM_IVEC2 = 5,
    SHADER_UNIFORM_IVEC3 = 6,
    SHADER_UNIFORM_IVEC4 = 7,
    SHADER_UNIFORM_UINT = 8,
    SHADER_UNIFORM_UIVEC2 = 9,
    SHADER_UNIFORM_UIVEC3 = 10,
    SHADER_UNIFORM_UIVEC4 = 11,
    SHADER_UNIFORM_SAMPLER2D = 12,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ShaderAttributeDataType {
    SHADER_ATTRIB_FLOAT = 0,
    SHADER_ATTRIB_VEC2 = 1,
    SHADER_ATTRIB_VEC3 = 2,
    SHADER_ATTRIB_VEC4 = 3,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum PixelFormat {
    PIXELFORMAT_UNCOMPRESSED_GRAYSCALE = 1,
    PIXELFORMAT_UNCOMPRESSED_GRAY_ALPHA = 2,
    PIXELFORMAT_UNCOMPRESSED_R5G6B5 = 3,
    PIXELFORMAT_UNCOMPRESSED_R8G8B8 = 4,
    PIXELFORMAT_UNCOMPRESSED_R5G5B5A1 = 5,
    PIXELFORMAT_UNCOMPRESSED_R4G4B4A4 = 6,
    PIXELFORMAT_UNCOMPRESSED_R8G8B8A8 = 7,
    PIXELFORMAT_UNCOMPRESSED_R32 = 8,
    PIXELFORMAT_UNCOMPRESSED_R32G32B32 = 9,
    PIXELFORMAT_UNCOMPRESSED_R32G32B32A32 = 10,
    PIXELFORMAT_UNCOMPRESSED_R16 = 11,
    PIXELFORMAT_UNCOMPRESSED_R16G16B16 = 12,
    PIXELFORMAT_UNCOMPRESSED_R16G16B16A16 = 13,
    PIXELFORMAT_COMPRESSED_DXT1_RGB = 14,
    PIXELFORMAT_COMPRESSED_DXT1_RGBA = 15,
    PIXELFORMAT_COMPRESSED_DXT3_RGBA = 16,
    PIXELFORMAT_COMPRESSED_DXT5_RGBA = 17,
    PIXELFORMAT_COMPRESSED_ETC1_RGB = 18,
    PIXELFORMAT_COMPRESSED_ETC2_RGB = 19,
    PIXELFORMAT_COMPRESSED_ETC2_EAC_RGBA = 20,
    PIXELFORMAT_COMPRESSED_PVRT_RGB = 21,
    PIXELFORMAT_COMPRESSED_PVRT_RGBA = 22,
    PIXELFORMAT_COMPRESSED_ASTC_4x4_RGBA = 23,
    PIXELFORMAT_COMPRESSED_ASTC_8x8_RGBA = 24,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum TextureFilter {
    TEXTURE_FILTER_POINT = 0,
    TEXTURE_FILTER_BILINEAR = 1,
    TEXTURE_FILTER_TRILINEAR = 2,
    TEXTURE_FILTER_ANISOTROPIC_4X = 3,
    TEXTURE_FILTER_ANISOTROPIC_8X = 4,
    TEXTURE_FILTER_ANISOTROPIC_16X = 5,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum TextureWrap {
    TEXTURE_WRAP_REPEAT = 0,
    TEXTURE_WRAP_CLAMP = 1,
    TEXTURE_WRAP_MIRROR_REPEAT = 2,
    TEXTURE_WRAP_MIRROR_CLAMP = 3,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum CubemapLayout {
    CUBEMAP_LAYOUT_AUTO_DETECT = 0,
    CUBEMAP_LAYOUT_LINE_VERTICAL = 1,
    CUBEMAP_LAYOUT_LINE_HORIZONTAL = 2,
    CUBEMAP_LAYOUT_CROSS_THREE_BY_FOUR = 3,
    CUBEMAP_LAYOUT_CROSS_FOUR_BY_THREE = 4,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum FontType {
    FONT_DEFAULT = 0,
    FONT_BITMAP = 1,
    FONT_SDF = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BlendMode {
    BLEND_ALPHA = 0,
    BLEND_ADDITIVE = 1,
    BLEND_MULTIPLIED = 2,
    BLEND_ADD_COLORS = 3,
    BLEND_SUBTRACT_COLORS = 4,
    BLEND_ALPHA_PREMULTIPLY = 5,
    BLEND_CUSTOM = 6,
    BLEND_CUSTOM_SEPARATE = 7,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum Gesture {
    GESTURE_NONE = 0,
    GESTURE_TAP = 1,
    GESTURE_DOUBLETAP = 2,
    GESTURE_HOLD = 4,
    GESTURE_DRAG = 8,
    GESTURE_SWIPE_RIGHT = 16,
    GESTURE_SWIPE_LEFT = 32,
    GESTURE_SWIPE_UP = 64,
    GESTURE_SWIPE_DOWN = 128,
    GESTURE_PINCH_IN = 256,
    GESTURE_PINCH_OUT = 512,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum CameraMode {
    CAMERA_CUSTOM = 0,
    CAMERA_FREE = 1,
    CAMERA_ORBITAL = 2,
    CAMERA_FIRST_PERSON = 3,
    CAMERA_THIRD_PERSON = 4,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum CameraProjection {
    CAMERA_PERSPECTIVE = 0,
    CAMERA_ORTHOGRAPHIC = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NPatchLayout {
    NPATCH_NINE_PATCH = 0,
    NPATCH_THREE_PATCH_VERTICAL = 1,
    NPATCH_THREE_PATCH_HORIZONTAL = 2,
}
pub type TraceLogCallback = ::core::option::Option<
    unsafe extern "C" fn(
        logLevel: ::core::ffi::c_int,
        text: *const ::core::ffi::c_char,
        args: va_list,
    ),
>;
pub type LoadFileDataCallback = ::core::option::Option<
    unsafe extern "C" fn(
        fileName: *const ::core::ffi::c_char,
        dataSize: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uchar,
>;
pub type SaveFileDataCallback = ::core::option::Option<
    unsafe extern "C" fn(
        fileName: *const ::core::ffi::c_char,
        data: *mut ::core::ffi::c_void,
        dataSize: ::core::ffi::c_int,
    ) -> bool,
>;
pub type LoadFileTextCallback = ::core::option::Option<
    unsafe extern "C" fn(fileName: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char,
>;
pub type SaveFileTextCallback = ::core::option::Option<
    unsafe extern "C" fn(
        fileName: *const ::core::ffi::c_char,
        text: *const ::core::ffi::c_char,
    ) -> bool,
>;
unsafe extern "C" {
    pub fn InitWindow(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        title: *const ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    pub fn CloseWindow();
}
unsafe extern "C" {
    pub fn WindowShouldClose() -> bool;
}
unsafe extern "C" {
    pub fn IsWindowReady() -> bool;
}
unsafe extern "C" {
    pub fn IsWindowFullscreen() -> bool;
}
unsafe extern "C" {
    pub fn IsWindowHidden() -> bool;
}
unsafe extern "C" {
    pub fn IsWindowMinimized() -> bool;
}
unsafe extern "C" {
    pub fn IsWindowMaximized() -> bool;
}
unsafe extern "C" {
    pub fn IsWindowFocused() -> bool;
}
unsafe extern "C" {
    pub fn IsWindowResized() -> bool;
}
unsafe extern "C" {
    pub fn IsWindowState(flag: ::core::ffi::c_uint) -> bool;
}
unsafe extern "C" {
    pub fn SetWindowState(flags: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn ClearWindowState(flags: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn ToggleFullscreen();
}
unsafe extern "C" {
    pub fn ToggleBorderlessWindowed();
}
unsafe extern "C" {
    pub fn MaximizeWindow();
}
unsafe extern "C" {
    pub fn MinimizeWindow();
}
unsafe extern "C" {
    pub fn RestoreWindow();
}
unsafe extern "C" {
    pub fn SetWindowIcon(image: Image);
}
unsafe extern "C" {
    pub fn SetWindowIcons(images: *mut Image, count: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetWindowTitle(title: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn SetWindowPosition(x: ::core::ffi::c_int, y: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetWindowMonitor(monitor: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetWindowMinSize(width: ::core::ffi::c_int, height: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetWindowMaxSize(width: ::core::ffi::c_int, height: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetWindowSize(width: ::core::ffi::c_int, height: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetWindowOpacity(opacity: f32);
}
unsafe extern "C" {
    pub fn SetWindowFocused();
}
unsafe extern "C" {
    pub fn GetWindowHandle() -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn GetScreenWidth() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetScreenHeight() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetRenderWidth() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetRenderHeight() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetMonitorCount() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetCurrentMonitor() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetMonitorPosition(monitor: ::core::ffi::c_int) -> Vector2;
}
unsafe extern "C" {
    pub fn GetMonitorWidth(monitor: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetMonitorHeight(monitor: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetMonitorPhysicalWidth(monitor: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetMonitorPhysicalHeight(monitor: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetMonitorRefreshRate(monitor: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetWindowPosition() -> Vector2;
}
unsafe extern "C" {
    pub fn GetWindowScaleDPI() -> Vector2;
}
unsafe extern "C" {
    pub fn GetMonitorName(monitor: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn SetClipboardText(text: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn GetClipboardText() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GetClipboardImage() -> Image;
}
unsafe extern "C" {
    pub fn EnableEventWaiting();
}
unsafe extern "C" {
    pub fn DisableEventWaiting();
}
unsafe extern "C" {
    pub fn ShowCursor();
}
unsafe extern "C" {
    pub fn HideCursor();
}
unsafe extern "C" {
    pub fn IsCursorHidden() -> bool;
}
unsafe extern "C" {
    pub fn EnableCursor();
}
unsafe extern "C" {
    pub fn DisableCursor();
}
unsafe extern "C" {
    pub fn IsCursorOnScreen() -> bool;
}
unsafe extern "C" {
    pub fn ClearBackground(color: Color);
}
unsafe extern "C" {
    pub fn BeginDrawing();
}
unsafe extern "C" {
    pub fn EndDrawing();
}
unsafe extern "C" {
    pub fn BeginMode2D(camera: Camera2D);
}
unsafe extern "C" {
    pub fn EndMode2D();
}
unsafe extern "C" {
    pub fn BeginMode3D(camera: Camera3D);
}
unsafe extern "C" {
    pub fn EndMode3D();
}
unsafe extern "C" {
    pub fn BeginTextureMode(target: RenderTexture2D);
}
unsafe extern "C" {
    pub fn EndTextureMode();
}
unsafe extern "C" {
    pub fn BeginShaderMode(shader: Shader);
}
unsafe extern "C" {
    pub fn EndShaderMode();
}
unsafe extern "C" {
    pub fn BeginBlendMode(mode: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn EndBlendMode();
}
unsafe extern "C" {
    pub fn BeginScissorMode(
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn EndScissorMode();
}
unsafe extern "C" {
    pub fn BeginVrStereoMode(config: VrStereoConfig);
}
unsafe extern "C" {
    pub fn EndVrStereoMode();
}
unsafe extern "C" {
    pub fn LoadVrStereoConfig(device: VrDeviceInfo) -> VrStereoConfig;
}
unsafe extern "C" {
    pub fn UnloadVrStereoConfig(config: VrStereoConfig);
}
unsafe extern "C" {
    pub fn LoadShader(
        vsFileName: *const ::core::ffi::c_char,
        fsFileName: *const ::core::ffi::c_char,
    ) -> Shader;
}
unsafe extern "C" {
    pub fn LoadShaderFromMemory(
        vsCode: *const ::core::ffi::c_char,
        fsCode: *const ::core::ffi::c_char,
    ) -> Shader;
}
unsafe extern "C" {
    pub fn IsShaderValid(shader: Shader) -> bool;
}
unsafe extern "C" {
    pub fn GetShaderLocation(
        shader: Shader,
        uniformName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetShaderLocationAttrib(
        shader: Shader,
        attribName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SetShaderValue(
        shader: Shader,
        locIndex: ::core::ffi::c_int,
        value: *const ::core::ffi::c_void,
        uniformType: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn SetShaderValueV(
        shader: Shader,
        locIndex: ::core::ffi::c_int,
        value: *const ::core::ffi::c_void,
        uniformType: ::core::ffi::c_int,
        count: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn SetShaderValueMatrix(shader: Shader, locIndex: ::core::ffi::c_int, mat: Matrix);
}
unsafe extern "C" {
    pub fn SetShaderValueTexture(shader: Shader, locIndex: ::core::ffi::c_int, texture: Texture2D);
}
unsafe extern "C" {
    pub fn UnloadShader(shader: Shader);
}
unsafe extern "C" {
    pub fn GetScreenToWorldRay(position: Vector2, camera: Camera) -> Ray;
}
unsafe extern "C" {
    pub fn GetScreenToWorldRayEx(
        position: Vector2,
        camera: Camera,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
    ) -> Ray;
}
unsafe extern "C" {
    pub fn GetWorldToScreen(position: Vector3, camera: Camera) -> Vector2;
}
unsafe extern "C" {
    pub fn GetWorldToScreenEx(
        position: Vector3,
        camera: Camera,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
    ) -> Vector2;
}
unsafe extern "C" {
    pub fn GetWorldToScreen2D(position: Vector2, camera: Camera2D) -> Vector2;
}
unsafe extern "C" {
    pub fn GetScreenToWorld2D(position: Vector2, camera: Camera2D) -> Vector2;
}
unsafe extern "C" {
    pub fn GetCameraMatrix(camera: Camera) -> Matrix;
}
unsafe extern "C" {
    pub fn GetCameraMatrix2D(camera: Camera2D) -> Matrix;
}
unsafe extern "C" {
    pub fn SetTargetFPS(fps: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn GetFrameTime() -> f32;
}
unsafe extern "C" {
    pub fn GetTime() -> f64;
}
unsafe extern "C" {
    pub fn GetFPS() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SwapScreenBuffer();
}
unsafe extern "C" {
    pub fn PollInputEvents();
}
unsafe extern "C" {
    pub fn WaitTime(seconds: f64);
}
unsafe extern "C" {
    pub fn SetRandomSeed(seed: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn GetRandomValue(min: ::core::ffi::c_int, max: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn LoadRandomSequence(
        count: ::core::ffi::c_uint,
        min: ::core::ffi::c_int,
        max: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn UnloadRandomSequence(sequence: *mut ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn TakeScreenshot(fileName: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn SetConfigFlags(flags: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn OpenURL(url: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn SetTraceLogLevel(logLevel: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn TraceLog(logLevel: ::core::ffi::c_int, text: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    pub fn SetTraceLogCallback(callback: TraceLogCallback);
}
unsafe extern "C" {
    pub fn MemAlloc(size: ::core::ffi::c_uint) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn MemRealloc(
        ptr: *mut ::core::ffi::c_void,
        size: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn MemFree(ptr: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn LoadFileData(
        fileName: *const ::core::ffi::c_char,
        dataSize: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn UnloadFileData(data: *mut ::core::ffi::c_uchar);
}
unsafe extern "C" {
    pub fn SaveFileData(
        fileName: *const ::core::ffi::c_char,
        data: *mut ::core::ffi::c_void,
        dataSize: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    pub fn ExportDataAsCode(
        data: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
        fileName: *const ::core::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn LoadFileText(fileName: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn UnloadFileText(text: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn SaveFileText(
        fileName: *const ::core::ffi::c_char,
        text: *const ::core::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn SetLoadFileDataCallback(callback: LoadFileDataCallback);
}
unsafe extern "C" {
    pub fn SetSaveFileDataCallback(callback: SaveFileDataCallback);
}
unsafe extern "C" {
    pub fn SetLoadFileTextCallback(callback: LoadFileTextCallback);
}
unsafe extern "C" {
    pub fn SetSaveFileTextCallback(callback: SaveFileTextCallback);
}
unsafe extern "C" {
    pub fn FileRename(
        fileName: *const ::core::ffi::c_char,
        fileRename: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn FileRemove(fileName: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn FileCopy(
        srcPath: *const ::core::ffi::c_char,
        dstPath: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn FileMove(
        srcPath: *const ::core::ffi::c_char,
        dstPath: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn FileTextReplace(
        fileName: *const ::core::ffi::c_char,
        search: *const ::core::ffi::c_char,
        replacement: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn FileTextFindIndex(
        fileName: *const ::core::ffi::c_char,
        search: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn FileExists(fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn DirectoryExists(dirPath: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn IsFileExtension(
        fileName: *const ::core::ffi::c_char,
        ext: *const ::core::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn GetFileLength(fileName: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetFileModTime(fileName: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn GetFileExtension(fileName: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GetFileName(filePath: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GetFileNameWithoutExt(
        filePath: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GetDirectoryPath(filePath: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GetPrevDirectoryPath(dirPath: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GetWorkingDirectory() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GetApplicationDirectory() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn MakeDirectory(dirPath: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ChangeDirectory(dirPath: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn IsPathFile(path: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn IsFileNameValid(fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn LoadDirectoryFiles(dirPath: *const ::core::ffi::c_char) -> FilePathList;
}
unsafe extern "C" {
    pub fn LoadDirectoryFilesEx(
        basePath: *const ::core::ffi::c_char,
        filter: *const ::core::ffi::c_char,
        scanSubdirs: bool,
    ) -> FilePathList;
}
unsafe extern "C" {
    pub fn UnloadDirectoryFiles(files: FilePathList);
}
unsafe extern "C" {
    pub fn IsFileDropped() -> bool;
}
unsafe extern "C" {
    pub fn LoadDroppedFiles() -> FilePathList;
}
unsafe extern "C" {
    pub fn UnloadDroppedFiles(files: FilePathList);
}
unsafe extern "C" {
    pub fn GetDirectoryFileCount(dirPath: *const ::core::ffi::c_char) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn GetDirectoryFileCountEx(
        basePath: *const ::core::ffi::c_char,
        filter: *const ::core::ffi::c_char,
        scanSubdirs: bool,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn CompressData(
        data: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
        compDataSize: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn DecompressData(
        compData: *const ::core::ffi::c_uchar,
        compDataSize: ::core::ffi::c_int,
        dataSize: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn EncodeDataBase64(
        data: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
        outputSize: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn DecodeDataBase64(
        text: *const ::core::ffi::c_char,
        outputSize: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn ComputeCRC32(
        data: *mut ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn ComputeMD5(
        data: *mut ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn ComputeSHA1(
        data: *mut ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn ComputeSHA256(
        data: *mut ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn LoadAutomationEventList(fileName: *const ::core::ffi::c_char) -> AutomationEventList;
}
unsafe extern "C" {
    pub fn UnloadAutomationEventList(list: AutomationEventList);
}
unsafe extern "C" {
    pub fn ExportAutomationEventList(
        list: AutomationEventList,
        fileName: *const ::core::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn SetAutomationEventList(list: *mut AutomationEventList);
}
unsafe extern "C" {
    pub fn SetAutomationEventBaseFrame(frame: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn StartAutomationEventRecording();
}
unsafe extern "C" {
    pub fn StopAutomationEventRecording();
}
unsafe extern "C" {
    pub fn PlayAutomationEvent(event: AutomationEvent);
}
unsafe extern "C" {
    pub fn IsKeyPressed(key: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsKeyPressedRepeat(key: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsKeyDown(key: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsKeyReleased(key: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsKeyUp(key: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn GetKeyPressed() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetCharPressed() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetKeyName(key: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn SetExitKey(key: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn IsGamepadAvailable(gamepad: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn GetGamepadName(gamepad: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn IsGamepadButtonPressed(gamepad: ::core::ffi::c_int, button: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsGamepadButtonDown(gamepad: ::core::ffi::c_int, button: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsGamepadButtonReleased(gamepad: ::core::ffi::c_int, button: ::core::ffi::c_int)
    -> bool;
}
unsafe extern "C" {
    pub fn IsGamepadButtonUp(gamepad: ::core::ffi::c_int, button: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn GetGamepadButtonPressed() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetGamepadAxisCount(gamepad: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetGamepadAxisMovement(gamepad: ::core::ffi::c_int, axis: ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn SetGamepadMappings(mappings: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SetGamepadVibration(
        gamepad: ::core::ffi::c_int,
        leftMotor: f32,
        rightMotor: f32,
        duration: f32,
    );
}
unsafe extern "C" {
    pub fn IsMouseButtonPressed(button: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsMouseButtonDown(button: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsMouseButtonReleased(button: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn IsMouseButtonUp(button: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    pub fn GetMouseX() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetMouseY() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetMousePosition() -> Vector2;
}
unsafe extern "C" {
    pub fn GetMouseDelta() -> Vector2;
}
unsafe extern "C" {
    pub fn SetMousePosition(x: ::core::ffi::c_int, y: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetMouseOffset(offsetX: ::core::ffi::c_int, offsetY: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetMouseScale(scaleX: f32, scaleY: f32);
}
unsafe extern "C" {
    pub fn GetMouseWheelMove() -> f32;
}
unsafe extern "C" {
    pub fn GetMouseWheelMoveV() -> Vector2;
}
unsafe extern "C" {
    pub fn SetMouseCursor(cursor: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn GetTouchX() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetTouchY() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetTouchPosition(index: ::core::ffi::c_int) -> Vector2;
}
unsafe extern "C" {
    pub fn GetTouchPointId(index: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetTouchPointCount() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn SetGesturesEnabled(flags: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn IsGestureDetected(gesture: ::core::ffi::c_uint) -> bool;
}
unsafe extern "C" {
    pub fn GetGestureDetected() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetGestureHoldDuration() -> f32;
}
unsafe extern "C" {
    pub fn GetGestureDragVector() -> Vector2;
}
unsafe extern "C" {
    pub fn GetGestureDragAngle() -> f32;
}
unsafe extern "C" {
    pub fn GetGesturePinchVector() -> Vector2;
}
unsafe extern "C" {
    pub fn GetGesturePinchAngle() -> f32;
}
unsafe extern "C" {
    pub fn UpdateCamera(camera: *mut Camera, mode: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn UpdateCameraPro(camera: *mut Camera, movement: Vector3, rotation: Vector3, zoom: f32);
}
unsafe extern "C" {
    pub fn SetShapesTexture(texture: Texture2D, source: Rectangle);
}
unsafe extern "C" {
    pub fn GetShapesTexture() -> Texture2D;
}
unsafe extern "C" {
    pub fn GetShapesTextureRectangle() -> Rectangle;
}
unsafe extern "C" {
    pub fn DrawPixel(posX: ::core::ffi::c_int, posY: ::core::ffi::c_int, color: Color);
}
unsafe extern "C" {
    pub fn DrawPixelV(position: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn DrawLine(
        startPosX: ::core::ffi::c_int,
        startPosY: ::core::ffi::c_int,
        endPosX: ::core::ffi::c_int,
        endPosY: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawLineV(startPos: Vector2, endPos: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn DrawLineEx(startPos: Vector2, endPos: Vector2, thick: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawLineStrip(points: *const Vector2, pointCount: ::core::ffi::c_int, color: Color);
}
unsafe extern "C" {
    pub fn DrawLineBezier(startPos: Vector2, endPos: Vector2, thick: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawLineDashed(
        startPos: Vector2,
        endPos: Vector2,
        dashSize: ::core::ffi::c_int,
        spaceSize: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCircle(
        centerX: ::core::ffi::c_int,
        centerY: ::core::ffi::c_int,
        radius: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCircleV(center: Vector2, radius: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawCircleGradient(center: Vector2, radius: f32, inner: Color, outer: Color);
}
unsafe extern "C" {
    pub fn DrawCircleSector(
        center: Vector2,
        radius: f32,
        startAngle: f32,
        endAngle: f32,
        segments: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCircleSectorLines(
        center: Vector2,
        radius: f32,
        startAngle: f32,
        endAngle: f32,
        segments: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCircleLines(
        centerX: ::core::ffi::c_int,
        centerY: ::core::ffi::c_int,
        radius: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCircleLinesV(center: Vector2, radius: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawEllipse(
        centerX: ::core::ffi::c_int,
        centerY: ::core::ffi::c_int,
        radiusH: f32,
        radiusV: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawEllipseV(center: Vector2, radiusH: f32, radiusV: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawEllipseLines(
        centerX: ::core::ffi::c_int,
        centerY: ::core::ffi::c_int,
        radiusH: f32,
        radiusV: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawEllipseLinesV(center: Vector2, radiusH: f32, radiusV: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawRing(
        center: Vector2,
        innerRadius: f32,
        outerRadius: f32,
        startAngle: f32,
        endAngle: f32,
        segments: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRingLines(
        center: Vector2,
        innerRadius: f32,
        outerRadius: f32,
        startAngle: f32,
        endAngle: f32,
        segments: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRectangle(
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRectangleV(position: Vector2, size: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn DrawRectangleRec(rec: Rectangle, color: Color);
}
unsafe extern "C" {
    pub fn DrawRectanglePro(rec: Rectangle, origin: Vector2, rotation: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawRectangleGradientV(
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        top: Color,
        bottom: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRectangleGradientH(
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        left: Color,
        right: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRectangleGradientEx(
        rec: Rectangle,
        topLeft: Color,
        bottomLeft: Color,
        bottomRight: Color,
        topRight: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRectangleLines(
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRectangleLinesEx(rec: Rectangle, lineThick: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawRectangleRounded(
        rec: Rectangle,
        roundness: f32,
        segments: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRectangleRoundedLines(
        rec: Rectangle,
        roundness: f32,
        segments: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawRectangleRoundedLinesEx(
        rec: Rectangle,
        roundness: f32,
        segments: ::core::ffi::c_int,
        lineThick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTriangle(v1: Vector2, v2: Vector2, v3: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn DrawTriangleLines(v1: Vector2, v2: Vector2, v3: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn DrawTriangleFan(points: *const Vector2, pointCount: ::core::ffi::c_int, color: Color);
}
unsafe extern "C" {
    pub fn DrawTriangleStrip(points: *const Vector2, pointCount: ::core::ffi::c_int, color: Color);
}
unsafe extern "C" {
    pub fn DrawPoly(
        center: Vector2,
        sides: ::core::ffi::c_int,
        radius: f32,
        rotation: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawPolyLines(
        center: Vector2,
        sides: ::core::ffi::c_int,
        radius: f32,
        rotation: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawPolyLinesEx(
        center: Vector2,
        sides: ::core::ffi::c_int,
        radius: f32,
        rotation: f32,
        lineThick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineLinear(
        points: *const Vector2,
        pointCount: ::core::ffi::c_int,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineBasis(
        points: *const Vector2,
        pointCount: ::core::ffi::c_int,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineCatmullRom(
        points: *const Vector2,
        pointCount: ::core::ffi::c_int,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineBezierQuadratic(
        points: *const Vector2,
        pointCount: ::core::ffi::c_int,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineBezierCubic(
        points: *const Vector2,
        pointCount: ::core::ffi::c_int,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineSegmentLinear(p1: Vector2, p2: Vector2, thick: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawSplineSegmentBasis(
        p1: Vector2,
        p2: Vector2,
        p3: Vector2,
        p4: Vector2,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineSegmentCatmullRom(
        p1: Vector2,
        p2: Vector2,
        p3: Vector2,
        p4: Vector2,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineSegmentBezierQuadratic(
        p1: Vector2,
        c2: Vector2,
        p3: Vector2,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSplineSegmentBezierCubic(
        p1: Vector2,
        c2: Vector2,
        c3: Vector2,
        p4: Vector2,
        thick: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn GetSplinePointLinear(startPos: Vector2, endPos: Vector2, t: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn GetSplinePointBasis(
        p1: Vector2,
        p2: Vector2,
        p3: Vector2,
        p4: Vector2,
        t: f32,
    ) -> Vector2;
}
unsafe extern "C" {
    pub fn GetSplinePointCatmullRom(
        p1: Vector2,
        p2: Vector2,
        p3: Vector2,
        p4: Vector2,
        t: f32,
    ) -> Vector2;
}
unsafe extern "C" {
    pub fn GetSplinePointBezierQuad(p1: Vector2, c2: Vector2, p3: Vector2, t: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn GetSplinePointBezierCubic(
        p1: Vector2,
        c2: Vector2,
        c3: Vector2,
        p4: Vector2,
        t: f32,
    ) -> Vector2;
}
unsafe extern "C" {
    pub fn CheckCollisionRecs(rec1: Rectangle, rec2: Rectangle) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionCircles(
        center1: Vector2,
        radius1: f32,
        center2: Vector2,
        radius2: f32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionCircleRec(center: Vector2, radius: f32, rec: Rectangle) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionCircleLine(center: Vector2, radius: f32, p1: Vector2, p2: Vector2)
    -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionPointRec(point: Vector2, rec: Rectangle) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionPointCircle(point: Vector2, center: Vector2, radius: f32) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionPointTriangle(
        point: Vector2,
        p1: Vector2,
        p2: Vector2,
        p3: Vector2,
    ) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionPointLine(
        point: Vector2,
        p1: Vector2,
        p2: Vector2,
        threshold: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionPointPoly(
        point: Vector2,
        points: *const Vector2,
        pointCount: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionLines(
        startPos1: Vector2,
        endPos1: Vector2,
        startPos2: Vector2,
        endPos2: Vector2,
        collisionPoint: *mut Vector2,
    ) -> bool;
}
unsafe extern "C" {
    pub fn GetCollisionRec(rec1: Rectangle, rec2: Rectangle) -> Rectangle;
}
unsafe extern "C" {
    pub fn LoadImage(fileName: *const ::core::ffi::c_char) -> Image;
}
unsafe extern "C" {
    pub fn LoadImageRaw(
        fileName: *const ::core::ffi::c_char,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        format: ::core::ffi::c_int,
        headerSize: ::core::ffi::c_int,
    ) -> Image;
}
unsafe extern "C" {
    pub fn LoadImageAnim(
        fileName: *const ::core::ffi::c_char,
        frames: *mut ::core::ffi::c_int,
    ) -> Image;
}
unsafe extern "C" {
    pub fn LoadImageAnimFromMemory(
        fileType: *const ::core::ffi::c_char,
        fileData: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
        frames: *mut ::core::ffi::c_int,
    ) -> Image;
}
unsafe extern "C" {
    pub fn LoadImageFromMemory(
        fileType: *const ::core::ffi::c_char,
        fileData: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
    ) -> Image;
}
unsafe extern "C" {
    pub fn LoadImageFromTexture(texture: Texture2D) -> Image;
}
unsafe extern "C" {
    pub fn LoadImageFromScreen() -> Image;
}
unsafe extern "C" {
    pub fn IsImageValid(image: Image) -> bool;
}
unsafe extern "C" {
    pub fn UnloadImage(image: Image);
}
unsafe extern "C" {
    pub fn ExportImage(image: Image, fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn ExportImageToMemory(
        image: Image,
        fileType: *const ::core::ffi::c_char,
        fileSize: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_uchar;
}
unsafe extern "C" {
    pub fn ExportImageAsCode(image: Image, fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn GenImageColor(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: Color,
    ) -> Image;
}
unsafe extern "C" {
    pub fn GenImageGradientLinear(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        direction: ::core::ffi::c_int,
        start: Color,
        end: Color,
    ) -> Image;
}
unsafe extern "C" {
    pub fn GenImageGradientRadial(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        density: f32,
        inner: Color,
        outer: Color,
    ) -> Image;
}
unsafe extern "C" {
    pub fn GenImageGradientSquare(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        density: f32,
        inner: Color,
        outer: Color,
    ) -> Image;
}
unsafe extern "C" {
    pub fn GenImageChecked(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        checksX: ::core::ffi::c_int,
        checksY: ::core::ffi::c_int,
        col1: Color,
        col2: Color,
    ) -> Image;
}
unsafe extern "C" {
    pub fn GenImageWhiteNoise(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        factor: f32,
    ) -> Image;
}
unsafe extern "C" {
    pub fn GenImagePerlinNoise(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        offsetX: ::core::ffi::c_int,
        offsetY: ::core::ffi::c_int,
        scale: f32,
    ) -> Image;
}
unsafe extern "C" {
    pub fn GenImageCellular(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        tileSize: ::core::ffi::c_int,
    ) -> Image;
}
unsafe extern "C" {
    pub fn GenImageText(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        text: *const ::core::ffi::c_char,
    ) -> Image;
}
unsafe extern "C" {
    pub fn ImageCopy(image: Image) -> Image;
}
unsafe extern "C" {
    pub fn ImageFromImage(image: Image, rec: Rectangle) -> Image;
}
unsafe extern "C" {
    pub fn ImageFromChannel(image: Image, selectedChannel: ::core::ffi::c_int) -> Image;
}
unsafe extern "C" {
    pub fn ImageText(
        text: *const ::core::ffi::c_char,
        fontSize: ::core::ffi::c_int,
        color: Color,
    ) -> Image;
}
unsafe extern "C" {
    pub fn ImageTextEx(
        font: Font,
        text: *const ::core::ffi::c_char,
        fontSize: f32,
        spacing: f32,
        tint: Color,
    ) -> Image;
}
unsafe extern "C" {
    pub fn ImageFormat(image: *mut Image, newFormat: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn ImageToPOT(image: *mut Image, fill: Color);
}
unsafe extern "C" {
    pub fn ImageCrop(image: *mut Image, crop: Rectangle);
}
unsafe extern "C" {
    pub fn ImageAlphaCrop(image: *mut Image, threshold: f32);
}
unsafe extern "C" {
    pub fn ImageAlphaClear(image: *mut Image, color: Color, threshold: f32);
}
unsafe extern "C" {
    pub fn ImageAlphaMask(image: *mut Image, alphaMask: Image);
}
unsafe extern "C" {
    pub fn ImageAlphaPremultiply(image: *mut Image);
}
unsafe extern "C" {
    pub fn ImageBlurGaussian(image: *mut Image, blurSize: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn ImageKernelConvolution(
        image: *mut Image,
        kernel: *const f32,
        kernelSize: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn ImageResize(
        image: *mut Image,
        newWidth: ::core::ffi::c_int,
        newHeight: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn ImageResizeNN(
        image: *mut Image,
        newWidth: ::core::ffi::c_int,
        newHeight: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn ImageResizeCanvas(
        image: *mut Image,
        newWidth: ::core::ffi::c_int,
        newHeight: ::core::ffi::c_int,
        offsetX: ::core::ffi::c_int,
        offsetY: ::core::ffi::c_int,
        fill: Color,
    );
}
unsafe extern "C" {
    pub fn ImageMipmaps(image: *mut Image);
}
unsafe extern "C" {
    pub fn ImageDither(
        image: *mut Image,
        rBpp: ::core::ffi::c_int,
        gBpp: ::core::ffi::c_int,
        bBpp: ::core::ffi::c_int,
        aBpp: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn ImageFlipVertical(image: *mut Image);
}
unsafe extern "C" {
    pub fn ImageFlipHorizontal(image: *mut Image);
}
unsafe extern "C" {
    pub fn ImageRotate(image: *mut Image, degrees: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn ImageRotateCW(image: *mut Image);
}
unsafe extern "C" {
    pub fn ImageRotateCCW(image: *mut Image);
}
unsafe extern "C" {
    pub fn ImageColorTint(image: *mut Image, color: Color);
}
unsafe extern "C" {
    pub fn ImageColorInvert(image: *mut Image);
}
unsafe extern "C" {
    pub fn ImageColorGrayscale(image: *mut Image);
}
unsafe extern "C" {
    pub fn ImageColorContrast(image: *mut Image, contrast: f32);
}
unsafe extern "C" {
    pub fn ImageColorBrightness(image: *mut Image, brightness: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn ImageColorReplace(image: *mut Image, color: Color, replace: Color);
}
unsafe extern "C" {
    pub fn LoadImageColors(image: Image) -> *mut Color;
}
unsafe extern "C" {
    pub fn LoadImagePalette(
        image: Image,
        maxPaletteSize: ::core::ffi::c_int,
        colorCount: *mut ::core::ffi::c_int,
    ) -> *mut Color;
}
unsafe extern "C" {
    pub fn UnloadImageColors(colors: *mut Color);
}
unsafe extern "C" {
    pub fn UnloadImagePalette(colors: *mut Color);
}
unsafe extern "C" {
    pub fn GetImageAlphaBorder(image: Image, threshold: f32) -> Rectangle;
}
unsafe extern "C" {
    pub fn GetImageColor(image: Image, x: ::core::ffi::c_int, y: ::core::ffi::c_int) -> Color;
}
unsafe extern "C" {
    pub fn ImageClearBackground(dst: *mut Image, color: Color);
}
unsafe extern "C" {
    pub fn ImageDrawPixel(
        dst: *mut Image,
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawPixelV(dst: *mut Image, position: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn ImageDrawLine(
        dst: *mut Image,
        startPosX: ::core::ffi::c_int,
        startPosY: ::core::ffi::c_int,
        endPosX: ::core::ffi::c_int,
        endPosY: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawLineV(dst: *mut Image, start: Vector2, end: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn ImageDrawLineEx(
        dst: *mut Image,
        start: Vector2,
        end: Vector2,
        thick: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawCircle(
        dst: *mut Image,
        centerX: ::core::ffi::c_int,
        centerY: ::core::ffi::c_int,
        radius: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawCircleV(
        dst: *mut Image,
        center: Vector2,
        radius: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawCircleLines(
        dst: *mut Image,
        centerX: ::core::ffi::c_int,
        centerY: ::core::ffi::c_int,
        radius: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawCircleLinesV(
        dst: *mut Image,
        center: Vector2,
        radius: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawRectangle(
        dst: *mut Image,
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawRectangleV(dst: *mut Image, position: Vector2, size: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn ImageDrawRectangleRec(dst: *mut Image, rec: Rectangle, color: Color);
}
unsafe extern "C" {
    pub fn ImageDrawRectangleLines(
        dst: *mut Image,
        rec: Rectangle,
        thick: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawTriangle(dst: *mut Image, v1: Vector2, v2: Vector2, v3: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn ImageDrawTriangleEx(
        dst: *mut Image,
        v1: Vector2,
        v2: Vector2,
        v3: Vector2,
        c1: Color,
        c2: Color,
        c3: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawTriangleLines(
        dst: *mut Image,
        v1: Vector2,
        v2: Vector2,
        v3: Vector2,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawTriangleFan(
        dst: *mut Image,
        points: *const Vector2,
        pointCount: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawTriangleStrip(
        dst: *mut Image,
        points: *const Vector2,
        pointCount: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDraw(
        dst: *mut Image,
        src: Image,
        srcRec: Rectangle,
        dstRec: Rectangle,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawText(
        dst: *mut Image,
        text: *const ::core::ffi::c_char,
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        fontSize: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn ImageDrawTextEx(
        dst: *mut Image,
        font: Font,
        text: *const ::core::ffi::c_char,
        position: Vector2,
        fontSize: f32,
        spacing: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn LoadTexture(fileName: *const ::core::ffi::c_char) -> Texture2D;
}
unsafe extern "C" {
    pub fn LoadTextureFromImage(image: Image) -> Texture2D;
}
unsafe extern "C" {
    pub fn LoadTextureCubemap(image: Image, layout: ::core::ffi::c_int) -> TextureCubemap;
}
unsafe extern "C" {
    pub fn LoadRenderTexture(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
    ) -> RenderTexture2D;
}
unsafe extern "C" {
    pub fn IsTextureValid(texture: Texture2D) -> bool;
}
unsafe extern "C" {
    pub fn UnloadTexture(texture: Texture2D);
}
unsafe extern "C" {
    pub fn IsRenderTextureValid(target: RenderTexture2D) -> bool;
}
unsafe extern "C" {
    pub fn UnloadRenderTexture(target: RenderTexture2D);
}
unsafe extern "C" {
    pub fn UpdateTexture(texture: Texture2D, pixels: *const ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn UpdateTextureRec(texture: Texture2D, rec: Rectangle, pixels: *const ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn GenTextureMipmaps(texture: *mut Texture2D);
}
unsafe extern "C" {
    pub fn SetTextureFilter(texture: Texture2D, filter: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetTextureWrap(texture: Texture2D, wrap: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn DrawTexture(
        texture: Texture2D,
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTextureV(texture: Texture2D, position: Vector2, tint: Color);
}
unsafe extern "C" {
    pub fn DrawTextureEx(
        texture: Texture2D,
        position: Vector2,
        rotation: f32,
        scale: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTextureRec(texture: Texture2D, source: Rectangle, position: Vector2, tint: Color);
}
unsafe extern "C" {
    pub fn DrawTexturePro(
        texture: Texture2D,
        source: Rectangle,
        dest: Rectangle,
        origin: Vector2,
        rotation: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTextureNPatch(
        texture: Texture2D,
        nPatchInfo: NPatchInfo,
        dest: Rectangle,
        origin: Vector2,
        rotation: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn ColorIsEqual(col1: Color, col2: Color) -> bool;
}
unsafe extern "C" {
    pub fn Fade(color: Color, alpha: f32) -> Color;
}
unsafe extern "C" {
    pub fn ColorToInt(color: Color) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ColorNormalize(color: Color) -> Vector4;
}
unsafe extern "C" {
    pub fn ColorFromNormalized(normalized: Vector4) -> Color;
}
unsafe extern "C" {
    pub fn ColorToHSV(color: Color) -> Vector3;
}
unsafe extern "C" {
    pub fn ColorFromHSV(hue: f32, saturation: f32, value: f32) -> Color;
}
unsafe extern "C" {
    pub fn ColorTint(color: Color, tint: Color) -> Color;
}
unsafe extern "C" {
    pub fn ColorBrightness(color: Color, factor: f32) -> Color;
}
unsafe extern "C" {
    pub fn ColorContrast(color: Color, contrast: f32) -> Color;
}
unsafe extern "C" {
    pub fn ColorAlpha(color: Color, alpha: f32) -> Color;
}
unsafe extern "C" {
    pub fn ColorAlphaBlend(dst: Color, src: Color, tint: Color) -> Color;
}
unsafe extern "C" {
    pub fn ColorLerp(color1: Color, color2: Color, factor: f32) -> Color;
}
unsafe extern "C" {
    pub fn GetColor(hexValue: ::core::ffi::c_uint) -> Color;
}
unsafe extern "C" {
    pub fn GetPixelColor(srcPtr: *mut ::core::ffi::c_void, format: ::core::ffi::c_int) -> Color;
}
unsafe extern "C" {
    pub fn SetPixelColor(
        dstPtr: *mut ::core::ffi::c_void,
        color: Color,
        format: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn GetPixelDataSize(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        format: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetFontDefault() -> Font;
}
unsafe extern "C" {
    pub fn LoadFont(fileName: *const ::core::ffi::c_char) -> Font;
}
unsafe extern "C" {
    pub fn LoadFontEx(
        fileName: *const ::core::ffi::c_char,
        fontSize: ::core::ffi::c_int,
        codepoints: *const ::core::ffi::c_int,
        codepointCount: ::core::ffi::c_int,
    ) -> Font;
}
unsafe extern "C" {
    pub fn LoadFontFromImage(image: Image, key: Color, firstChar: ::core::ffi::c_int) -> Font;
}
unsafe extern "C" {
    pub fn LoadFontFromMemory(
        fileType: *const ::core::ffi::c_char,
        fileData: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
        fontSize: ::core::ffi::c_int,
        codepoints: *const ::core::ffi::c_int,
        codepointCount: ::core::ffi::c_int,
    ) -> Font;
}
unsafe extern "C" {
    pub fn IsFontValid(font: Font) -> bool;
}
unsafe extern "C" {
    pub fn LoadFontData(
        fileData: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
        fontSize: ::core::ffi::c_int,
        codepoints: *const ::core::ffi::c_int,
        codepointCount: ::core::ffi::c_int,
        type_: ::core::ffi::c_int,
        glyphCount: *mut ::core::ffi::c_int,
    ) -> *mut GlyphInfo;
}
unsafe extern "C" {
    pub fn GenImageFontAtlas(
        glyphs: *const GlyphInfo,
        glyphRecs: *mut *mut Rectangle,
        glyphCount: ::core::ffi::c_int,
        fontSize: ::core::ffi::c_int,
        padding: ::core::ffi::c_int,
        packMethod: ::core::ffi::c_int,
    ) -> Image;
}
unsafe extern "C" {
    pub fn UnloadFontData(glyphs: *mut GlyphInfo, glyphCount: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn UnloadFont(font: Font);
}
unsafe extern "C" {
    pub fn ExportFontAsCode(font: Font, fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn DrawFPS(posX: ::core::ffi::c_int, posY: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn DrawText(
        text: *const ::core::ffi::c_char,
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        fontSize: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTextEx(
        font: Font,
        text: *const ::core::ffi::c_char,
        position: Vector2,
        fontSize: f32,
        spacing: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTextPro(
        font: Font,
        text: *const ::core::ffi::c_char,
        position: Vector2,
        origin: Vector2,
        rotation: f32,
        fontSize: f32,
        spacing: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTextCodepoint(
        font: Font,
        codepoint: ::core::ffi::c_int,
        position: Vector2,
        fontSize: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTextCodepoints(
        font: Font,
        codepoints: *const ::core::ffi::c_int,
        codepointCount: ::core::ffi::c_int,
        position: Vector2,
        fontSize: f32,
        spacing: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn SetTextLineSpacing(spacing: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn MeasureText(
        text: *const ::core::ffi::c_char,
        fontSize: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn MeasureTextEx(
        font: Font,
        text: *const ::core::ffi::c_char,
        fontSize: f32,
        spacing: f32,
    ) -> Vector2;
}
unsafe extern "C" {
    pub fn MeasureTextCodepoints(
        font: Font,
        codepoints: *const ::core::ffi::c_int,
        length: ::core::ffi::c_int,
        fontSize: f32,
        spacing: f32,
    ) -> Vector2;
}
unsafe extern "C" {
    pub fn GetGlyphIndex(font: Font, codepoint: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetGlyphInfo(font: Font, codepoint: ::core::ffi::c_int) -> GlyphInfo;
}
unsafe extern "C" {
    pub fn GetGlyphAtlasRec(font: Font, codepoint: ::core::ffi::c_int) -> Rectangle;
}
unsafe extern "C" {
    pub fn LoadUTF8(
        codepoints: *const ::core::ffi::c_int,
        length: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn UnloadUTF8(text: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn LoadCodepoints(
        text: *const ::core::ffi::c_char,
        count: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn UnloadCodepoints(codepoints: *mut ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn GetCodepointCount(text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetCodepoint(
        text: *const ::core::ffi::c_char,
        codepointSize: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetCodepointNext(
        text: *const ::core::ffi::c_char,
        codepointSize: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GetCodepointPrevious(
        text: *const ::core::ffi::c_char,
        codepointSize: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn CodepointToUTF8(
        codepoint: ::core::ffi::c_int,
        utf8Size: *mut ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn LoadTextLines(
        text: *const ::core::ffi::c_char,
        count: *mut ::core::ffi::c_int,
    ) -> *mut *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn UnloadTextLines(text: *mut *mut ::core::ffi::c_char, lineCount: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn TextCopy(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TextIsEqual(
        text1: *const ::core::ffi::c_char,
        text2: *const ::core::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    pub fn TextLength(text: *const ::core::ffi::c_char) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn TextFormat(text: *const ::core::ffi::c_char, ...) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextSubtext(
        text: *const ::core::ffi::c_char,
        position: ::core::ffi::c_int,
        length: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextRemoveSpaces(text: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GetTextBetween(
        text: *const ::core::ffi::c_char,
        begin: *const ::core::ffi::c_char,
        end: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextReplace(
        text: *const ::core::ffi::c_char,
        search: *const ::core::ffi::c_char,
        replacement: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextReplaceAlloc(
        text: *const ::core::ffi::c_char,
        search: *const ::core::ffi::c_char,
        replacement: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextReplaceBetween(
        text: *const ::core::ffi::c_char,
        begin: *const ::core::ffi::c_char,
        end: *const ::core::ffi::c_char,
        replacement: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextReplaceBetweenAlloc(
        text: *const ::core::ffi::c_char,
        begin: *const ::core::ffi::c_char,
        end: *const ::core::ffi::c_char,
        replacement: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextInsert(
        text: *const ::core::ffi::c_char,
        insert: *const ::core::ffi::c_char,
        position: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextInsertAlloc(
        text: *const ::core::ffi::c_char,
        insert: *const ::core::ffi::c_char,
        position: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextJoin(
        textList: *mut *mut ::core::ffi::c_char,
        count: ::core::ffi::c_int,
        delimiter: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextSplit(
        text: *const ::core::ffi::c_char,
        delimiter: ::core::ffi::c_char,
        count: *mut ::core::ffi::c_int,
    ) -> *mut *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextAppend(
        text: *mut ::core::ffi::c_char,
        append: *const ::core::ffi::c_char,
        position: *mut ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn TextFindIndex(
        text: *const ::core::ffi::c_char,
        search: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TextToUpper(text: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextToLower(text: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextToPascal(text: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextToSnake(text: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextToCamel(text: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TextToInteger(text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TextToFloat(text: *const ::core::ffi::c_char) -> f32;
}
unsafe extern "C" {
    pub fn DrawLine3D(startPos: Vector3, endPos: Vector3, color: Color);
}
unsafe extern "C" {
    pub fn DrawPoint3D(position: Vector3, color: Color);
}
unsafe extern "C" {
    pub fn DrawCircle3D(
        center: Vector3,
        radius: f32,
        rotationAxis: Vector3,
        rotationAngle: f32,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawTriangle3D(v1: Vector3, v2: Vector3, v3: Vector3, color: Color);
}
unsafe extern "C" {
    pub fn DrawTriangleStrip3D(
        points: *const Vector3,
        pointCount: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCube(position: Vector3, width: f32, height: f32, length: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawCubeV(position: Vector3, size: Vector3, color: Color);
}
unsafe extern "C" {
    pub fn DrawCubeWires(position: Vector3, width: f32, height: f32, length: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawCubeWiresV(position: Vector3, size: Vector3, color: Color);
}
unsafe extern "C" {
    pub fn DrawSphere(centerPos: Vector3, radius: f32, color: Color);
}
unsafe extern "C" {
    pub fn DrawSphereEx(
        centerPos: Vector3,
        radius: f32,
        rings: ::core::ffi::c_int,
        slices: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawSphereWires(
        centerPos: Vector3,
        radius: f32,
        rings: ::core::ffi::c_int,
        slices: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCylinder(
        position: Vector3,
        radiusTop: f32,
        radiusBottom: f32,
        height: f32,
        slices: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCylinderEx(
        startPos: Vector3,
        endPos: Vector3,
        startRadius: f32,
        endRadius: f32,
        sides: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCylinderWires(
        position: Vector3,
        radiusTop: f32,
        radiusBottom: f32,
        height: f32,
        slices: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCylinderWiresEx(
        startPos: Vector3,
        endPos: Vector3,
        startRadius: f32,
        endRadius: f32,
        sides: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCapsule(
        startPos: Vector3,
        endPos: Vector3,
        radius: f32,
        slices: ::core::ffi::c_int,
        rings: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawCapsuleWires(
        startPos: Vector3,
        endPos: Vector3,
        radius: f32,
        slices: ::core::ffi::c_int,
        rings: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn DrawPlane(centerPos: Vector3, size: Vector2, color: Color);
}
unsafe extern "C" {
    pub fn DrawRay(ray: Ray, color: Color);
}
unsafe extern "C" {
    pub fn DrawGrid(slices: ::core::ffi::c_int, spacing: f32);
}
unsafe extern "C" {
    pub fn LoadModel(fileName: *const ::core::ffi::c_char) -> Model;
}
unsafe extern "C" {
    pub fn LoadModelFromMesh(mesh: Mesh) -> Model;
}
unsafe extern "C" {
    pub fn IsModelValid(model: Model) -> bool;
}
unsafe extern "C" {
    pub fn UnloadModel(model: Model);
}
unsafe extern "C" {
    pub fn GetModelBoundingBox(model: Model) -> BoundingBox;
}
unsafe extern "C" {
    pub fn DrawModel(model: Model, position: Vector3, scale: f32, tint: Color);
}
unsafe extern "C" {
    pub fn DrawModelEx(
        model: Model,
        position: Vector3,
        rotationAxis: Vector3,
        rotationAngle: f32,
        scale: Vector3,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawModelWires(model: Model, position: Vector3, scale: f32, tint: Color);
}
unsafe extern "C" {
    pub fn DrawModelWiresEx(
        model: Model,
        position: Vector3,
        rotationAxis: Vector3,
        rotationAngle: f32,
        scale: Vector3,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawBoundingBox(box_: BoundingBox, color: Color);
}
unsafe extern "C" {
    pub fn DrawBillboard(
        camera: Camera,
        texture: Texture2D,
        position: Vector3,
        scale: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawBillboardRec(
        camera: Camera,
        texture: Texture2D,
        source: Rectangle,
        position: Vector3,
        size: Vector2,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn DrawBillboardPro(
        camera: Camera,
        texture: Texture2D,
        source: Rectangle,
        position: Vector3,
        up: Vector3,
        size: Vector2,
        origin: Vector2,
        rotation: f32,
        tint: Color,
    );
}
unsafe extern "C" {
    pub fn UploadMesh(mesh: *mut Mesh, dynamic: bool);
}
unsafe extern "C" {
    pub fn UpdateMeshBuffer(
        mesh: Mesh,
        index: ::core::ffi::c_int,
        data: *const ::core::ffi::c_void,
        dataSize: ::core::ffi::c_int,
        offset: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn UnloadMesh(mesh: Mesh);
}
unsafe extern "C" {
    pub fn DrawMesh(mesh: Mesh, material: Material, transform: Matrix);
}
unsafe extern "C" {
    pub fn DrawMeshInstanced(
        mesh: Mesh,
        material: Material,
        transforms: *const Matrix,
        instances: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn GetMeshBoundingBox(mesh: Mesh) -> BoundingBox;
}
unsafe extern "C" {
    pub fn GenMeshTangents(mesh: *mut Mesh);
}
unsafe extern "C" {
    pub fn ExportMesh(mesh: Mesh, fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn ExportMeshAsCode(mesh: Mesh, fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn GenMeshPoly(sides: ::core::ffi::c_int, radius: f32) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshPlane(
        width: f32,
        length: f32,
        resX: ::core::ffi::c_int,
        resZ: ::core::ffi::c_int,
    ) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshCube(width: f32, height: f32, length: f32) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshSphere(
        radius: f32,
        rings: ::core::ffi::c_int,
        slices: ::core::ffi::c_int,
    ) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshHemiSphere(
        radius: f32,
        rings: ::core::ffi::c_int,
        slices: ::core::ffi::c_int,
    ) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshCylinder(radius: f32, height: f32, slices: ::core::ffi::c_int) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshCone(radius: f32, height: f32, slices: ::core::ffi::c_int) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshTorus(
        radius: f32,
        size: f32,
        radSeg: ::core::ffi::c_int,
        sides: ::core::ffi::c_int,
    ) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshKnot(
        radius: f32,
        size: f32,
        radSeg: ::core::ffi::c_int,
        sides: ::core::ffi::c_int,
    ) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshHeightmap(heightmap: Image, size: Vector3) -> Mesh;
}
unsafe extern "C" {
    pub fn GenMeshCubicmap(cubicmap: Image, cubeSize: Vector3) -> Mesh;
}
unsafe extern "C" {
    pub fn LoadMaterials(
        fileName: *const ::core::ffi::c_char,
        materialCount: *mut ::core::ffi::c_int,
    ) -> *mut Material;
}
unsafe extern "C" {
    pub fn LoadMaterialDefault() -> Material;
}
unsafe extern "C" {
    pub fn IsMaterialValid(material: Material) -> bool;
}
unsafe extern "C" {
    pub fn UnloadMaterial(material: Material);
}
unsafe extern "C" {
    pub fn SetMaterialTexture(
        material: *mut Material,
        mapType: ::core::ffi::c_int,
        texture: Texture2D,
    );
}
unsafe extern "C" {
    pub fn SetModelMeshMaterial(
        model: *mut Model,
        meshId: ::core::ffi::c_int,
        materialId: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn LoadModelAnimations(
        fileName: *const ::core::ffi::c_char,
        animCount: *mut ::core::ffi::c_int,
    ) -> *mut ModelAnimation;
}
unsafe extern "C" {
    pub fn UpdateModelAnimation(model: Model, anim: ModelAnimation, frame: f32);
}
unsafe extern "C" {
    pub fn UpdateModelAnimationEx(
        model: Model,
        animA: ModelAnimation,
        frameA: f32,
        animB: ModelAnimation,
        frameB: f32,
        blend: f32,
    );
}
unsafe extern "C" {
    pub fn UnloadModelAnimations(animations: *mut ModelAnimation, animCount: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn IsModelAnimationValid(model: Model, anim: ModelAnimation) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionSpheres(
        center1: Vector3,
        radius1: f32,
        center2: Vector3,
        radius2: f32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionBoxes(box1: BoundingBox, box2: BoundingBox) -> bool;
}
unsafe extern "C" {
    pub fn CheckCollisionBoxSphere(box_: BoundingBox, center: Vector3, radius: f32) -> bool;
}
unsafe extern "C" {
    pub fn GetRayCollisionSphere(ray: Ray, center: Vector3, radius: f32) -> RayCollision;
}
unsafe extern "C" {
    pub fn GetRayCollisionBox(ray: Ray, box_: BoundingBox) -> RayCollision;
}
unsafe extern "C" {
    pub fn GetRayCollisionMesh(ray: Ray, mesh: Mesh, transform: Matrix) -> RayCollision;
}
unsafe extern "C" {
    pub fn GetRayCollisionTriangle(ray: Ray, p1: Vector3, p2: Vector3, p3: Vector3)
    -> RayCollision;
}
unsafe extern "C" {
    pub fn GetRayCollisionQuad(
        ray: Ray,
        p1: Vector3,
        p2: Vector3,
        p3: Vector3,
        p4: Vector3,
    ) -> RayCollision;
}
pub type AudioCallback = ::core::option::Option<
    unsafe extern "C" fn(bufferData: *mut ::core::ffi::c_void, frames: ::core::ffi::c_uint),
>;
unsafe extern "C" {
    pub fn InitAudioDevice();
}
unsafe extern "C" {
    pub fn CloseAudioDevice();
}
unsafe extern "C" {
    pub fn IsAudioDeviceReady() -> bool;
}
unsafe extern "C" {
    pub fn SetMasterVolume(volume: f32);
}
unsafe extern "C" {
    pub fn GetMasterVolume() -> f32;
}
unsafe extern "C" {
    pub fn LoadWave(fileName: *const ::core::ffi::c_char) -> Wave;
}
unsafe extern "C" {
    pub fn LoadWaveFromMemory(
        fileType: *const ::core::ffi::c_char,
        fileData: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
    ) -> Wave;
}
unsafe extern "C" {
    pub fn IsWaveValid(wave: Wave) -> bool;
}
unsafe extern "C" {
    pub fn LoadSound(fileName: *const ::core::ffi::c_char) -> Sound;
}
unsafe extern "C" {
    pub fn LoadSoundFromWave(wave: Wave) -> Sound;
}
unsafe extern "C" {
    pub fn LoadSoundAlias(source: Sound) -> Sound;
}
unsafe extern "C" {
    pub fn IsSoundValid(sound: Sound) -> bool;
}
unsafe extern "C" {
    pub fn UpdateSound(
        sound: Sound,
        data: *const ::core::ffi::c_void,
        sampleCount: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn UnloadWave(wave: Wave);
}
unsafe extern "C" {
    pub fn UnloadSound(sound: Sound);
}
unsafe extern "C" {
    pub fn UnloadSoundAlias(alias: Sound);
}
unsafe extern "C" {
    pub fn ExportWave(wave: Wave, fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn ExportWaveAsCode(wave: Wave, fileName: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    pub fn PlaySound(sound: Sound);
}
unsafe extern "C" {
    pub fn StopSound(sound: Sound);
}
unsafe extern "C" {
    pub fn PauseSound(sound: Sound);
}
unsafe extern "C" {
    pub fn ResumeSound(sound: Sound);
}
unsafe extern "C" {
    pub fn IsSoundPlaying(sound: Sound) -> bool;
}
unsafe extern "C" {
    pub fn SetSoundVolume(sound: Sound, volume: f32);
}
unsafe extern "C" {
    pub fn SetSoundPitch(sound: Sound, pitch: f32);
}
unsafe extern "C" {
    pub fn SetSoundPan(sound: Sound, pan: f32);
}
unsafe extern "C" {
    pub fn WaveCopy(wave: Wave) -> Wave;
}
unsafe extern "C" {
    pub fn WaveCrop(wave: *mut Wave, initFrame: ::core::ffi::c_int, finalFrame: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn WaveFormat(
        wave: *mut Wave,
        sampleRate: ::core::ffi::c_int,
        sampleSize: ::core::ffi::c_int,
        channels: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn LoadWaveSamples(wave: Wave) -> *mut f32;
}
unsafe extern "C" {
    pub fn UnloadWaveSamples(samples: *mut f32);
}
unsafe extern "C" {
    pub fn LoadMusicStream(fileName: *const ::core::ffi::c_char) -> Music;
}
unsafe extern "C" {
    pub fn LoadMusicStreamFromMemory(
        fileType: *const ::core::ffi::c_char,
        data: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
    ) -> Music;
}
unsafe extern "C" {
    pub fn IsMusicValid(music: Music) -> bool;
}
unsafe extern "C" {
    pub fn UnloadMusicStream(music: Music);
}
unsafe extern "C" {
    pub fn PlayMusicStream(music: Music);
}
unsafe extern "C" {
    pub fn IsMusicStreamPlaying(music: Music) -> bool;
}
unsafe extern "C" {
    pub fn UpdateMusicStream(music: Music);
}
unsafe extern "C" {
    pub fn StopMusicStream(music: Music);
}
unsafe extern "C" {
    pub fn PauseMusicStream(music: Music);
}
unsafe extern "C" {
    pub fn ResumeMusicStream(music: Music);
}
unsafe extern "C" {
    pub fn SeekMusicStream(music: Music, position: f32);
}
unsafe extern "C" {
    pub fn SetMusicVolume(music: Music, volume: f32);
}
unsafe extern "C" {
    pub fn SetMusicPitch(music: Music, pitch: f32);
}
unsafe extern "C" {
    pub fn SetMusicPan(music: Music, pan: f32);
}
unsafe extern "C" {
    pub fn GetMusicTimeLength(music: Music) -> f32;
}
unsafe extern "C" {
    pub fn GetMusicTimePlayed(music: Music) -> f32;
}
unsafe extern "C" {
    pub fn LoadAudioStream(
        sampleRate: ::core::ffi::c_uint,
        sampleSize: ::core::ffi::c_uint,
        channels: ::core::ffi::c_uint,
    ) -> AudioStream;
}
unsafe extern "C" {
    pub fn IsAudioStreamValid(stream: AudioStream) -> bool;
}
unsafe extern "C" {
    pub fn UnloadAudioStream(stream: AudioStream);
}
unsafe extern "C" {
    pub fn UpdateAudioStream(
        stream: AudioStream,
        data: *const ::core::ffi::c_void,
        frameCount: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn IsAudioStreamProcessed(stream: AudioStream) -> bool;
}
unsafe extern "C" {
    pub fn PlayAudioStream(stream: AudioStream);
}
unsafe extern "C" {
    pub fn PauseAudioStream(stream: AudioStream);
}
unsafe extern "C" {
    pub fn ResumeAudioStream(stream: AudioStream);
}
unsafe extern "C" {
    pub fn IsAudioStreamPlaying(stream: AudioStream) -> bool;
}
unsafe extern "C" {
    pub fn StopAudioStream(stream: AudioStream);
}
unsafe extern "C" {
    pub fn SetAudioStreamVolume(stream: AudioStream, volume: f32);
}
unsafe extern "C" {
    pub fn SetAudioStreamPitch(stream: AudioStream, pitch: f32);
}
unsafe extern "C" {
    pub fn SetAudioStreamPan(stream: AudioStream, pan: f32);
}
unsafe extern "C" {
    pub fn SetAudioStreamBufferSizeDefault(size: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn SetAudioStreamCallback(stream: AudioStream, callback: AudioCallback);
}
unsafe extern "C" {
    pub fn AttachAudioStreamProcessor(stream: AudioStream, processor: AudioCallback);
}
unsafe extern "C" {
    pub fn DetachAudioStreamProcessor(stream: AudioStream, processor: AudioCallback);
}
unsafe extern "C" {
    pub fn AttachAudioMixedProcessor(processor: AudioCallback);
}
unsafe extern "C" {
    pub fn DetachAudioMixedProcessor(processor: AudioCallback);
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct GuiStyleProp {
    pub controlId: ::core::ffi::c_ushort,
    pub propertyId: ::core::ffi::c_ushort,
    pub propertyValue: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GuiStyleProp"][::core::mem::size_of::<GuiStyleProp>() - 8usize];
    ["Alignment of GuiStyleProp"][::core::mem::align_of::<GuiStyleProp>() - 4usize];
    ["Offset of field: GuiStyleProp::controlId"]
        [::core::mem::offset_of!(GuiStyleProp, controlId) - 0usize];
    ["Offset of field: GuiStyleProp::propertyId"]
        [::core::mem::offset_of!(GuiStyleProp, propertyId) - 2usize];
    ["Offset of field: GuiStyleProp::propertyValue"]
        [::core::mem::offset_of!(GuiStyleProp, propertyValue) - 4usize];
};
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiState {
    STATE_NORMAL = 0,
    STATE_FOCUSED = 1,
    STATE_PRESSED = 2,
    STATE_DISABLED = 3,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiTextAlignment {
    TEXT_ALIGN_LEFT = 0,
    TEXT_ALIGN_CENTER = 1,
    TEXT_ALIGN_RIGHT = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiTextAlignmentVertical {
    TEXT_ALIGN_TOP = 0,
    TEXT_ALIGN_MIDDLE = 1,
    TEXT_ALIGN_BOTTOM = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiTextWrapMode {
    TEXT_WRAP_NONE = 0,
    TEXT_WRAP_CHAR = 1,
    TEXT_WRAP_WORD = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiControl {
    DEFAULT = 0,
    LABEL = 1,
    BUTTON = 2,
    TOGGLE = 3,
    SLIDER = 4,
    PROGRESSBAR = 5,
    CHECKBOX = 6,
    COMBOBOX = 7,
    DROPDOWNBOX = 8,
    TEXTBOX = 9,
    VALUEBOX = 10,
    CONTROL11 = 11,
    LISTVIEW = 12,
    COLORPICKER = 13,
    SCROLLBAR = 14,
    STATUSBAR = 15,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiControlProperty {
    BORDER_COLOR_NORMAL = 0,
    BASE_COLOR_NORMAL = 1,
    TEXT_COLOR_NORMAL = 2,
    BORDER_COLOR_FOCUSED = 3,
    BASE_COLOR_FOCUSED = 4,
    TEXT_COLOR_FOCUSED = 5,
    BORDER_COLOR_PRESSED = 6,
    BASE_COLOR_PRESSED = 7,
    TEXT_COLOR_PRESSED = 8,
    BORDER_COLOR_DISABLED = 9,
    BASE_COLOR_DISABLED = 10,
    TEXT_COLOR_DISABLED = 11,
    BORDER_WIDTH = 12,
    TEXT_PADDING = 13,
    TEXT_ALIGNMENT = 14,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiDefaultProperty {
    TEXT_SIZE = 16,
    TEXT_SPACING = 17,
    LINE_COLOR = 18,
    BACKGROUND_COLOR = 19,
    TEXT_LINE_SPACING = 20,
    TEXT_ALIGNMENT_VERTICAL = 21,
    TEXT_WRAP_MODE = 22,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiToggleProperty {
    GROUP_PADDING = 16,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiSliderProperty {
    SLIDER_WIDTH = 16,
    SLIDER_PADDING = 17,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiProgressBarProperty {
    PROGRESS_PADDING = 16,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiScrollBarProperty {
    ARROWS_SIZE = 16,
    ARROWS_VISIBLE = 17,
    SCROLL_SLIDER_PADDING = 18,
    SCROLL_SLIDER_SIZE = 19,
    SCROLL_PADDING = 20,
    SCROLL_SPEED = 21,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiCheckBoxProperty {
    CHECK_PADDING = 16,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiComboBoxProperty {
    COMBO_BUTTON_WIDTH = 16,
    COMBO_BUTTON_SPACING = 17,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiDropdownBoxProperty {
    ARROW_PADDING = 16,
    DROPDOWN_ITEMS_SPACING = 17,
    DROPDOWN_ARROW_HIDDEN = 18,
    DROPDOWN_ROLL_UP = 19,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiTextBoxProperty {
    TEXT_READONLY = 16,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiValueBoxProperty {
    SPINNER_BUTTON_WIDTH = 16,
    SPINNER_BUTTON_SPACING = 17,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiListViewProperty {
    LIST_ITEMS_HEIGHT = 16,
    LIST_ITEMS_SPACING = 17,
    SCROLLBAR_WIDTH = 18,
    SCROLLBAR_SIDE = 19,
    LIST_ITEMS_BORDER_NORMAL = 20,
    LIST_ITEMS_BORDER_WIDTH = 21,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiColorPickerProperty {
    COLOR_SELECTOR_SIZE = 16,
    HUEBAR_WIDTH = 17,
    HUEBAR_PADDING = 18,
    HUEBAR_SELECTOR_HEIGHT = 19,
    HUEBAR_SELECTOR_OVERFLOW = 20,
}
unsafe extern "C" {
    pub fn GuiEnable();
}
unsafe extern "C" {
    pub fn GuiDisable();
}
unsafe extern "C" {
    pub fn GuiLock();
}
unsafe extern "C" {
    pub fn GuiUnlock();
}
unsafe extern "C" {
    pub fn GuiIsLocked() -> bool;
}
unsafe extern "C" {
    pub fn GuiSetAlpha(alpha: f32);
}
unsafe extern "C" {
    pub fn GuiSetState(state: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn GuiGetState() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiSetFont(font: Font);
}
unsafe extern "C" {
    pub fn GuiGetFont() -> Font;
}
unsafe extern "C" {
    pub fn GuiSetStyle(
        control: ::core::ffi::c_int,
        property: ::core::ffi::c_int,
        value: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn GuiGetStyle(
        control: ::core::ffi::c_int,
        property: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiLoadStyle(fileName: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn GuiLoadStyleFromMemory(
        fileData: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn GuiLoadStyleDefault();
}
unsafe extern "C" {
    pub fn GuiEnableTooltip();
}
unsafe extern "C" {
    pub fn GuiDisableTooltip();
}
unsafe extern "C" {
    pub fn GuiSetTooltip(tooltip: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn GuiIconText(
        iconId: ::core::ffi::c_int,
        text: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GuiSetIconScale(scale: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn GuiGetIcons() -> *mut ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn GuiLoadIcons(
        fileName: *const ::core::ffi::c_char,
        loadIconsName: bool,
    ) -> *mut *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GuiLoadIconsFromMemory(
        fileData: *const ::core::ffi::c_uchar,
        dataSize: ::core::ffi::c_int,
        loadIconsName: bool,
    ) -> *mut *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn GuiDrawIcon(
        iconId: ::core::ffi::c_int,
        posX: ::core::ffi::c_int,
        posY: ::core::ffi::c_int,
        pixelSize: ::core::ffi::c_int,
        color: Color,
    );
}
unsafe extern "C" {
    pub fn GuiWindowBox(bounds: Rectangle, title: *const ::core::ffi::c_char)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiGroupBox(bounds: Rectangle, text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiLine(bounds: Rectangle, text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiPanel(bounds: Rectangle, text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiTabBar(
        bounds: Rectangle,
        text: *mut *const ::core::ffi::c_char,
        count: ::core::ffi::c_int,
        active: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiScrollPanel(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        content: Rectangle,
        scroll: *mut Vector2,
        view: *mut Rectangle,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiLabel(bounds: Rectangle, text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiButton(bounds: Rectangle, text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiLabelButton(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiToggle(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        active: *mut bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiToggleGroup(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        active: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiToggleSlider(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        active: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiCheckBox(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        checked: *mut bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiComboBox(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        active: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiDropdownBox(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        active: *mut ::core::ffi::c_int,
        editMode: bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiSpinner(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        value: *mut ::core::ffi::c_int,
        minValue: ::core::ffi::c_int,
        maxValue: ::core::ffi::c_int,
        editMode: bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiValueBox(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        value: *mut ::core::ffi::c_int,
        minValue: ::core::ffi::c_int,
        maxValue: ::core::ffi::c_int,
        editMode: bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiValueBoxFloat(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        textValue: *mut ::core::ffi::c_char,
        value: *mut f32,
        editMode: bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiTextBox(
        bounds: Rectangle,
        text: *mut ::core::ffi::c_char,
        textSize: ::core::ffi::c_int,
        editMode: bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiSlider(
        bounds: Rectangle,
        textLeft: *const ::core::ffi::c_char,
        textRight: *const ::core::ffi::c_char,
        value: *mut f32,
        minValue: f32,
        maxValue: f32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiSliderBar(
        bounds: Rectangle,
        textLeft: *const ::core::ffi::c_char,
        textRight: *const ::core::ffi::c_char,
        value: *mut f32,
        minValue: f32,
        maxValue: f32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiProgressBar(
        bounds: Rectangle,
        textLeft: *const ::core::ffi::c_char,
        textRight: *const ::core::ffi::c_char,
        value: *mut f32,
        minValue: f32,
        maxValue: f32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiStatusBar(bounds: Rectangle, text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiDummyRec(bounds: Rectangle, text: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiGrid(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        spacing: f32,
        subdivs: ::core::ffi::c_int,
        mouseCell: *mut Vector2,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiListView(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        scrollIndex: *mut ::core::ffi::c_int,
        active: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiListViewEx(
        bounds: Rectangle,
        text: *mut *const ::core::ffi::c_char,
        count: ::core::ffi::c_int,
        scrollIndex: *mut ::core::ffi::c_int,
        active: *mut ::core::ffi::c_int,
        focus: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiMessageBox(
        bounds: Rectangle,
        title: *const ::core::ffi::c_char,
        message: *const ::core::ffi::c_char,
        buttons: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiTextInputBox(
        bounds: Rectangle,
        title: *const ::core::ffi::c_char,
        message: *const ::core::ffi::c_char,
        buttons: *const ::core::ffi::c_char,
        text: *mut ::core::ffi::c_char,
        textMaxSize: ::core::ffi::c_int,
        secretViewActive: *mut bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiColorPicker(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        color: *mut Color,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiColorPanel(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        color: *mut Color,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiColorBarAlpha(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        alpha: *mut f32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiColorBarHue(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        value: *mut f32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiColorPickerHSV(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        colorHsv: *mut Vector3,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn GuiColorPanelHSV(
        bounds: Rectangle,
        text: *const ::core::ffi::c_char,
        colorHsv: *mut Vector3,
    ) -> ::core::ffi::c_int;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GuiIconName {
    ICON_NONE = 0,
    ICON_FOLDER_FILE_OPEN = 1,
    ICON_FILE_SAVE_CLASSIC = 2,
    ICON_FOLDER_OPEN = 3,
    ICON_FOLDER_SAVE = 4,
    ICON_FILE_OPEN = 5,
    ICON_FILE_SAVE = 6,
    ICON_FILE_EXPORT = 7,
    ICON_FILE_ADD = 8,
    ICON_FILE_DELETE = 9,
    ICON_FILETYPE_TEXT = 10,
    ICON_FILETYPE_AUDIO = 11,
    ICON_FILETYPE_IMAGE = 12,
    ICON_FILETYPE_PLAY = 13,
    ICON_FILETYPE_VIDEO = 14,
    ICON_FILETYPE_INFO = 15,
    ICON_FILE_COPY = 16,
    ICON_FILE_CUT = 17,
    ICON_FILE_PASTE = 18,
    ICON_CURSOR_HAND = 19,
    ICON_CURSOR_POINTER = 20,
    ICON_CURSOR_CLASSIC = 21,
    ICON_PENCIL = 22,
    ICON_PENCIL_BIG = 23,
    ICON_BRUSH_CLASSIC = 24,
    ICON_BRUSH_PAINTER = 25,
    ICON_WATER_DROP = 26,
    ICON_COLOR_PICKER = 27,
    ICON_RUBBER = 28,
    ICON_COLOR_BUCKET = 29,
    ICON_TEXT_T = 30,
    ICON_TEXT_A = 31,
    ICON_SCALE = 32,
    ICON_RESIZE = 33,
    ICON_FILTER_POINT = 34,
    ICON_FILTER_BILINEAR = 35,
    ICON_CROP = 36,
    ICON_CROP_ALPHA = 37,
    ICON_SQUARE_TOGGLE = 38,
    ICON_SYMMETRY = 39,
    ICON_SYMMETRY_HORIZONTAL = 40,
    ICON_SYMMETRY_VERTICAL = 41,
    ICON_LENS = 42,
    ICON_LENS_BIG = 43,
    ICON_EYE_ON = 44,
    ICON_EYE_OFF = 45,
    ICON_FILTER_TOP = 46,
    ICON_FILTER = 47,
    ICON_TARGET_POINT = 48,
    ICON_TARGET_SMALL = 49,
    ICON_TARGET_BIG = 50,
    ICON_TARGET_MOVE = 51,
    ICON_CURSOR_MOVE = 52,
    ICON_CURSOR_SCALE = 53,
    ICON_CURSOR_SCALE_RIGHT = 54,
    ICON_CURSOR_SCALE_LEFT = 55,
    ICON_UNDO = 56,
    ICON_REDO = 57,
    ICON_REREDO = 58,
    ICON_MUTATE = 59,
    ICON_ROTATE = 60,
    ICON_REPEAT = 61,
    ICON_SHUFFLE = 62,
    ICON_EMPTYBOX = 63,
    ICON_TARGET = 64,
    ICON_TARGET_SMALL_FILL = 65,
    ICON_TARGET_BIG_FILL = 66,
    ICON_TARGET_MOVE_FILL = 67,
    ICON_CURSOR_MOVE_FILL = 68,
    ICON_CURSOR_SCALE_FILL = 69,
    ICON_CURSOR_SCALE_RIGHT_FILL = 70,
    ICON_CURSOR_SCALE_LEFT_FILL = 71,
    ICON_UNDO_FILL = 72,
    ICON_REDO_FILL = 73,
    ICON_REREDO_FILL = 74,
    ICON_MUTATE_FILL = 75,
    ICON_ROTATE_FILL = 76,
    ICON_REPEAT_FILL = 77,
    ICON_SHUFFLE_FILL = 78,
    ICON_EMPTYBOX_SMALL = 79,
    ICON_BOX = 80,
    ICON_BOX_TOP = 81,
    ICON_BOX_TOP_RIGHT = 82,
    ICON_BOX_RIGHT = 83,
    ICON_BOX_BOTTOM_RIGHT = 84,
    ICON_BOX_BOTTOM = 85,
    ICON_BOX_BOTTOM_LEFT = 86,
    ICON_BOX_LEFT = 87,
    ICON_BOX_TOP_LEFT = 88,
    ICON_BOX_CENTER = 89,
    ICON_BOX_CIRCLE_MASK = 90,
    ICON_POT = 91,
    ICON_ALPHA_MULTIPLY = 92,
    ICON_ALPHA_CLEAR = 93,
    ICON_DITHERING = 94,
    ICON_MIPMAPS = 95,
    ICON_BOX_GRID = 96,
    ICON_GRID = 97,
    ICON_BOX_CORNERS_SMALL = 98,
    ICON_BOX_CORNERS_BIG = 99,
    ICON_FOUR_BOXES = 100,
    ICON_GRID_FILL = 101,
    ICON_BOX_MULTISIZE = 102,
    ICON_ZOOM_SMALL = 103,
    ICON_ZOOM_MEDIUM = 104,
    ICON_ZOOM_BIG = 105,
    ICON_ZOOM_ALL = 106,
    ICON_ZOOM_CENTER = 107,
    ICON_BOX_DOTS_SMALL = 108,
    ICON_BOX_DOTS_BIG = 109,
    ICON_BOX_CONCENTRIC = 110,
    ICON_BOX_GRID_BIG = 111,
    ICON_OK_TICK = 112,
    ICON_CROSS = 113,
    ICON_ARROW_LEFT = 114,
    ICON_ARROW_RIGHT = 115,
    ICON_ARROW_DOWN = 116,
    ICON_ARROW_UP = 117,
    ICON_ARROW_LEFT_FILL = 118,
    ICON_ARROW_RIGHT_FILL = 119,
    ICON_ARROW_DOWN_FILL = 120,
    ICON_ARROW_UP_FILL = 121,
    ICON_AUDIO = 122,
    ICON_FX = 123,
    ICON_WAVE = 124,
    ICON_WAVE_SINUS = 125,
    ICON_WAVE_SQUARE = 126,
    ICON_WAVE_TRIANGULAR = 127,
    ICON_CROSS_SMALL = 128,
    ICON_PLAYER_PREVIOUS = 129,
    ICON_PLAYER_PLAY_BACK = 130,
    ICON_PLAYER_PLAY = 131,
    ICON_PLAYER_PAUSE = 132,
    ICON_PLAYER_STOP = 133,
    ICON_PLAYER_NEXT = 134,
    ICON_PLAYER_RECORD = 135,
    ICON_MAGNET = 136,
    ICON_LOCK_CLOSE = 137,
    ICON_LOCK_OPEN = 138,
    ICON_CLOCK = 139,
    ICON_TOOLS = 140,
    ICON_GEAR = 141,
    ICON_GEAR_BIG = 142,
    ICON_BIN = 143,
    ICON_HAND_POINTER = 144,
    ICON_LASER = 145,
    ICON_COIN = 146,
    ICON_EXPLOSION = 147,
    ICON_1UP = 148,
    ICON_PLAYER = 149,
    ICON_PLAYER_JUMP = 150,
    ICON_KEY = 151,
    ICON_DEMON = 152,
    ICON_TEXT_POPUP = 153,
    ICON_GEAR_EX = 154,
    ICON_CRACK = 155,
    ICON_CRACK_POINTS = 156,
    ICON_STAR = 157,
    ICON_DOOR = 158,
    ICON_EXIT = 159,
    ICON_MODE_2D = 160,
    ICON_MODE_3D = 161,
    ICON_CUBE = 162,
    ICON_CUBE_FACE_TOP = 163,
    ICON_CUBE_FACE_LEFT = 164,
    ICON_CUBE_FACE_FRONT = 165,
    ICON_CUBE_FACE_BOTTOM = 166,
    ICON_CUBE_FACE_RIGHT = 167,
    ICON_CUBE_FACE_BACK = 168,
    ICON_CAMERA = 169,
    ICON_SPECIAL = 170,
    ICON_LINK_NET = 171,
    ICON_LINK_BOXES = 172,
    ICON_LINK_MULTI = 173,
    ICON_LINK = 174,
    ICON_LINK_BROKE = 175,
    ICON_TEXT_NOTES = 176,
    ICON_NOTEBOOK = 177,
    ICON_SUITCASE = 178,
    ICON_SUITCASE_ZIP = 179,
    ICON_MAILBOX = 180,
    ICON_MONITOR = 181,
    ICON_PRINTER = 182,
    ICON_PHOTO_CAMERA = 183,
    ICON_PHOTO_CAMERA_FLASH = 184,
    ICON_HOUSE = 185,
    ICON_HEART = 186,
    ICON_CORNER = 187,
    ICON_VERTICAL_BARS = 188,
    ICON_VERTICAL_BARS_FILL = 189,
    ICON_LIFE_BARS = 190,
    ICON_INFO = 191,
    ICON_CROSSLINE = 192,
    ICON_HELP = 193,
    ICON_FILETYPE_ALPHA = 194,
    ICON_FILETYPE_HOME = 195,
    ICON_LAYERS_VISIBLE = 196,
    ICON_LAYERS = 197,
    ICON_WINDOW = 198,
    ICON_HIDPI = 199,
    ICON_FILETYPE_BINARY = 200,
    ICON_HEX = 201,
    ICON_SHIELD = 202,
    ICON_FILE_NEW = 203,
    ICON_FOLDER_ADD = 204,
    ICON_ALARM = 205,
    ICON_CPU = 206,
    ICON_ROM = 207,
    ICON_STEP_OVER = 208,
    ICON_STEP_INTO = 209,
    ICON_STEP_OUT = 210,
    ICON_RESTART = 211,
    ICON_BREAKPOINT_ON = 212,
    ICON_BREAKPOINT_OFF = 213,
    ICON_BURGER_MENU = 214,
    ICON_CASE_SENSITIVE = 215,
    ICON_REG_EXP = 216,
    ICON_FOLDER = 217,
    ICON_FILE = 218,
    ICON_SAND_TIMER = 219,
    ICON_WARNING = 220,
    ICON_HELP_BOX = 221,
    ICON_INFO_BOX = 222,
    ICON_PRIORITY = 223,
    ICON_LAYERS_ISO = 224,
    ICON_LAYERS2 = 225,
    ICON_MLAYERS = 226,
    ICON_MAPS = 227,
    ICON_HOT = 228,
    ICON_LABEL = 229,
    ICON_NAME_ID = 230,
    ICON_SLICING = 231,
    ICON_MANUAL_CONTROL = 232,
    ICON_COLLISION = 233,
    ICON_234 = 234,
    ICON_235 = 235,
    ICON_236 = 236,
    ICON_237 = 237,
    ICON_238 = 238,
    ICON_239 = 239,
    ICON_240 = 240,
    ICON_241 = 241,
    ICON_242 = 242,
    ICON_243 = 243,
    ICON_244 = 244,
    ICON_245 = 245,
    ICON_246 = 246,
    ICON_247 = 247,
    ICON_248 = 248,
    ICON_249 = 249,
    ICON_250 = 250,
    ICON_251 = 251,
    ICON_252 = 252,
    ICON_253 = 253,
    ICON_254 = 254,
    ICON_255 = 255,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct float3 {
    pub v: [f32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of float3"][::core::mem::size_of::<float3>() - 12usize];
    ["Alignment of float3"][::core::mem::align_of::<float3>() - 4usize];
    ["Offset of field: float3::v"][::core::mem::offset_of!(float3, v) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct float16 {
    pub v: [f32; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of float16"][::core::mem::size_of::<float16>() - 64usize];
    ["Alignment of float16"][::core::mem::align_of::<float16>() - 4usize];
    ["Offset of field: float16::v"][::core::mem::offset_of!(float16, v) - 0usize];
};
unsafe extern "C" {
    pub fn __va_start(arg1: *mut *mut ::core::ffi::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::core::ffi::c_ushort;
unsafe extern "C" {
    pub fn __security_init_cookie();
}
unsafe extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo();
}
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
unsafe extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::core::ffi::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::core::ffi::c_int;
pub type wint_t = ::core::ffi::c_ushort;
pub type wctype_t = ::core::ffi::c_ushort;
pub type __time32_t = ::core::ffi::c_long;
pub type __time64_t = ::core::ffi::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::core::ffi::c_ushort,
    pub _locale_mb_cur_max: ::core::ffi::c_int,
    pub _locale_lc_codepage: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::core::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::core::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
impl Default for __crt_locale_data_public {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::core::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::core::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::core::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::core::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
impl Default for __crt_locale_pointers {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _Mbstatet {
    pub _Wchar: ::core::ffi::c_ulong,
    pub _Byte: ::core::ffi::c_ushort,
    pub _State: ::core::ffi::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::core::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::core::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::core::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::core::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::core::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _exception {
    pub type_: ::core::ffi::c_int,
    pub name: *mut ::core::ffi::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _exception"][::core::mem::size_of::<_exception>() - 40usize];
    ["Alignment of _exception"][::core::mem::align_of::<_exception>() - 8usize];
    ["Offset of field: _exception::type_"][::core::mem::offset_of!(_exception, type_) - 0usize];
    ["Offset of field: _exception::name"][::core::mem::offset_of!(_exception, name) - 8usize];
    ["Offset of field: _exception::arg1"][::core::mem::offset_of!(_exception, arg1) - 16usize];
    ["Offset of field: _exception::arg2"][::core::mem::offset_of!(_exception, arg2) - 24usize];
    ["Offset of field: _exception::retval"][::core::mem::offset_of!(_exception, retval) - 32usize];
};
impl Default for _exception {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _complex {
    pub x: f64,
    pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _complex"][::core::mem::size_of::<_complex>() - 16usize];
    ["Alignment of _complex"][::core::mem::align_of::<_complex>() - 8usize];
    ["Offset of field: _complex::x"][::core::mem::offset_of!(_complex, x) - 0usize];
    ["Offset of field: _complex::y"][::core::mem::offset_of!(_complex, y) - 8usize];
};
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub static _HUGE: f64;
}
unsafe extern "C" {
    pub fn _fperrraise(_Except: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn _dclass(_X: f64) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _ldclass(_X: f64) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _fdclass(_X: f32) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _dsign(_X: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _ldsign(_X: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fdsign(_X: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _dpcomp(_X: f64, _Y: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _ldpcomp(_X: f64, _Y: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fdpcomp(_X: f32, _Y: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _dtest(_Px: *mut f64) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _ldtest(_Px: *mut f64) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _fdtest(_Px: *mut f32) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _d_int(_Px: *mut f64, _Xexp: ::core::ffi::c_short) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _ld_int(_Px: *mut f64, _Xexp: ::core::ffi::c_short) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _fd_int(_Px: *mut f32, _Xexp: ::core::ffi::c_short) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _dscale(_Px: *mut f64, _Lexp: ::core::ffi::c_long) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _ldscale(_Px: *mut f64, _Lexp: ::core::ffi::c_long) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _fdscale(_Px: *mut f32, _Lexp: ::core::ffi::c_long) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _dunscale(_Pex: *mut ::core::ffi::c_short, _Px: *mut f64) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _ldunscale(_Pex: *mut ::core::ffi::c_short, _Px: *mut f64) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _fdunscale(_Pex: *mut ::core::ffi::c_short, _Px: *mut f32) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _dexp(_Px: *mut f64, _Y: f64, _Eoff: ::core::ffi::c_long) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _ldexp(_Px: *mut f64, _Y: f64, _Eoff: ::core::ffi::c_long) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _fdexp(_Px: *mut f32, _Y: f32, _Eoff: ::core::ffi::c_long) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _dnorm(_Ps: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _fdnorm(_Ps: *mut ::core::ffi::c_ushort) -> ::core::ffi::c_short;
}
unsafe extern "C" {
    pub fn _dpoly(_X: f64, _Tab: *const f64, _N: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn _ldpoly(_X: f64, _Tab: *const f64, _N: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn _fdpoly(_X: f32, _Tab: *const f32, _N: ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn _dlog(_X: f64, _Baseflag: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn _ldlog(_X: f64, _Baseflag: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn _fdlog(_X: f32, _Baseflag: ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn _dsin(_X: f64, _Qoff: ::core::ffi::c_uint) -> f64;
}
unsafe extern "C" {
    pub fn _ldsin(_X: f64, _Qoff: ::core::ffi::c_uint) -> f64;
}
unsafe extern "C" {
    pub fn _fdsin(_X: f32, _Qoff: ::core::ffi::c_uint) -> f32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _double_val {
    pub _Sh: [::core::ffi::c_ushort; 4usize],
    pub _Val: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _double_val"][::core::mem::size_of::<_double_val>() - 8usize];
    ["Alignment of _double_val"][::core::mem::align_of::<_double_val>() - 8usize];
    ["Offset of field: _double_val::_Sh"][::core::mem::offset_of!(_double_val, _Sh) - 0usize];
    ["Offset of field: _double_val::_Val"][::core::mem::offset_of!(_double_val, _Val) - 0usize];
};
impl Default for _double_val {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _float_val {
    pub _Sh: [::core::ffi::c_ushort; 2usize],
    pub _Val: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _float_val"][::core::mem::size_of::<_float_val>() - 4usize];
    ["Alignment of _float_val"][::core::mem::align_of::<_float_val>() - 4usize];
    ["Offset of field: _float_val::_Sh"][::core::mem::offset_of!(_float_val, _Sh) - 0usize];
    ["Offset of field: _float_val::_Val"][::core::mem::offset_of!(_float_val, _Val) - 0usize];
};
impl Default for _float_val {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ldouble_val {
    pub _Sh: [::core::ffi::c_ushort; 4usize],
    pub _Val: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ldouble_val"][::core::mem::size_of::<_ldouble_val>() - 8usize];
    ["Alignment of _ldouble_val"][::core::mem::align_of::<_ldouble_val>() - 8usize];
    ["Offset of field: _ldouble_val::_Sh"][::core::mem::offset_of!(_ldouble_val, _Sh) - 0usize];
    ["Offset of field: _ldouble_val::_Val"][::core::mem::offset_of!(_ldouble_val, _Val) - 0usize];
};
impl Default for _ldouble_val {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _float_const {
    pub _Word: [::core::ffi::c_ushort; 4usize],
    pub _Float: f32,
    pub _Double: f64,
    pub _Long_double: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _float_const"][::core::mem::size_of::<_float_const>() - 8usize];
    ["Alignment of _float_const"][::core::mem::align_of::<_float_const>() - 8usize];
    ["Offset of field: _float_const::_Word"][::core::mem::offset_of!(_float_const, _Word) - 0usize];
    ["Offset of field: _float_const::_Float"]
        [::core::mem::offset_of!(_float_const, _Float) - 0usize];
    ["Offset of field: _float_const::_Double"]
        [::core::mem::offset_of!(_float_const, _Double) - 0usize];
    ["Offset of field: _float_const::_Long_double"]
        [::core::mem::offset_of!(_float_const, _Long_double) - 0usize];
};
impl Default for _float_const {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub static _Denorm_C: _float_const;
}
unsafe extern "C" {
    pub static _Inf_C: _float_const;
}
unsafe extern "C" {
    pub static _Nan_C: _float_const;
}
unsafe extern "C" {
    pub static _Snan_C: _float_const;
}
unsafe extern "C" {
    pub static _Hugeval_C: _float_const;
}
unsafe extern "C" {
    pub static _FDenorm_C: _float_const;
}
unsafe extern "C" {
    pub static _FInf_C: _float_const;
}
unsafe extern "C" {
    pub static _FNan_C: _float_const;
}
unsafe extern "C" {
    pub static _FSnan_C: _float_const;
}
unsafe extern "C" {
    pub static _LDenorm_C: _float_const;
}
unsafe extern "C" {
    pub static _LInf_C: _float_const;
}
unsafe extern "C" {
    pub static _LNan_C: _float_const;
}
unsafe extern "C" {
    pub static _LSnan_C: _float_const;
}
unsafe extern "C" {
    pub static _Eps_C: _float_const;
}
unsafe extern "C" {
    pub static _Rteps_C: _float_const;
}
unsafe extern "C" {
    pub static _FEps_C: _float_const;
}
unsafe extern "C" {
    pub static _FRteps_C: _float_const;
}
unsafe extern "C" {
    pub static _LEps_C: _float_const;
}
unsafe extern "C" {
    pub static _LRteps_C: _float_const;
}
unsafe extern "C" {
    pub static _Zero_C: f64;
}
unsafe extern "C" {
    pub static _Xbig_C: f64;
}
unsafe extern "C" {
    pub static _FZero_C: f32;
}
unsafe extern "C" {
    pub static _FXbig_C: f32;
}
unsafe extern "C" {
    pub static _LZero_C: f64;
}
unsafe extern "C" {
    pub static _LXbig_C: f64;
}
unsafe extern "C" {
    pub fn abs(_X: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn labs(_X: ::core::ffi::c_long) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn llabs(_X: ::core::ffi::c_longlong) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn acos(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn asin(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2(_Y: f64, _X: f64) -> f64;
}
unsafe extern "C" {
    pub fn cos(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabs(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmod(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn log(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn pow(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn sin(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrt(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn tan(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atof(_String: *const ::core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    pub fn _atof_l(_String: *const ::core::ffi::c_char, _Locale: _locale_t) -> f64;
}
unsafe extern "C" {
    pub fn _cabs(_Complex_value: _complex) -> f64;
}
unsafe extern "C" {
    pub fn cbrt(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceil(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _chgsign(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysign(_Number: f64, _Sign: f64) -> f64;
}
unsafe extern "C" {
    pub fn _copysign(_Number: f64, _Sign: f64) -> f64;
}
unsafe extern "C" {
    pub fn erf(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfc(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdim(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn floor(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fma(_X: f64, _Y: f64, _Z: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmax(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmin(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn frexp(_X: f64, _Y: *mut ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn hypot(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn _hypot(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn ilogb(_X: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ldexp(_X: f64, _Y: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lgamma(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn llrint(_X: f64) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn llround(_X: f64) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn log1p(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn logb(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn lrint(_X: f64) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn lround(_X: f64) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn _matherr(_Except: *mut _exception) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn modf(_X: f64, _Y: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn nan(_X: *const ::core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nearbyint(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafter(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttoward(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainder(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquo(_X: f64, _Y: f64, _Z: *mut ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn rint(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn round(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalbln(_X: f64, _Y: ::core::ffi::c_long) -> f64;
}
unsafe extern "C" {
    pub fn scalbn(_X: f64, _Y: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn tgamma(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn trunc(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _j0(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _j1(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _jn(_X: ::core::ffi::c_int, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn _y0(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _y1(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _yn(_X: ::core::ffi::c_int, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinhf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanhf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn cbrtf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn _chgsignf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn copysignf(_Number: f32, _Sign: f32) -> f32;
}
unsafe extern "C" {
    pub fn _copysignf(_Number: f32, _Sign: f32) -> f32;
}
unsafe extern "C" {
    pub fn erff(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn erfcf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1f(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2f(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn fdimf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaf(_X: f32, _Y: f32, _Z: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaxf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fminf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn _hypotf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn ilogbf(_X: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn lgammaf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn llrintf(_X: f32) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn llroundf(_X: f32) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn log1pf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2f(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn logbf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn lrintf(_X: f32) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn lroundf(_X: f32) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn nanf(_X: *const ::core::ffi::c_char) -> f32;
}
unsafe extern "C" {
    pub fn nearbyintf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn nextafterf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn nexttowardf(_X: f32, _Y: f64) -> f32;
}
unsafe extern "C" {
    pub fn remainderf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn remquof(_X: f32, _Y: f32, _Z: *mut ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn rintf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn roundf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn scalblnf(_X: f32, _Y: ::core::ffi::c_long) -> f32;
}
unsafe extern "C" {
    pub fn scalbnf(_X: f32, _Y: ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn tgammaf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn truncf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn _logbf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn _nextafterf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn _finitef(_X: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _isnanf(_X: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fpclassf(_X: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _set_FMA3_enable(_Flag: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _get_FMA3_enable() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn acosf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2f(_Y: f32, _X: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn ceilf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn coshf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn expf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn fabsf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn floorf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmodf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn frexpf(_X: f32, _Y: *mut ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn hypotf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn ldexpf(_X: f32, _Y: ::core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    pub fn log10f(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn logf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn modff(_X: f32, _Y: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn powf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinhf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn sqrtf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanhf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn acoshl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2l(_Y: f64, _X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrtl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceill(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _chgsignl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysignl(_Number: f64, _Sign: f64) -> f64;
}
unsafe extern "C" {
    pub fn _copysignl(_Number: f64, _Sign: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfcl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn expl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2l(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1l(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabsl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdiml(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn floorl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmal(_X: f64, _Y: f64, _Z: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaxl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fminl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmodl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn frexpl(_X: f64, _Y: *mut ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogbl(_X: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _hypotl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypotl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn ldexpl(_X: f64, _Y: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lgammal(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn llrintl(_X: f64) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn llroundl(_X: f64) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn logl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10l(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2l(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn lrintl(_X: f64) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn lroundl(_X: f64) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn modfl(_X: f64, _Y: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn nanl(_X: *const ::core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nearbyintl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafterl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttowardl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn powl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainderl(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquol(_X: f64, _Y: f64, _Z: *mut ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn rintl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn roundl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalblnl(_X: f64, _Y: ::core::ffi::c_long) -> f64;
}
unsafe extern "C" {
    pub fn scalbnl(_X: f64, _Y: ::core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    pub fn sinhl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrtl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgammal(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn truncl(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn Clamp(value: f32, min: f32, max: f32) -> f32;
}
unsafe extern "C" {
    pub fn Lerp(start: f32, end: f32, amount: f32) -> f32;
}
unsafe extern "C" {
    pub fn Normalize(value: f32, start: f32, end: f32) -> f32;
}
unsafe extern "C" {
    pub fn Remap(
        value: f32,
        inputStart: f32,
        inputEnd: f32,
        outputStart: f32,
        outputEnd: f32,
    ) -> f32;
}
unsafe extern "C" {
    pub fn Wrap(value: f32, min: f32, max: f32) -> f32;
}
unsafe extern "C" {
    pub fn FloatEquals(x: f32, y: f32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Vector2Zero() -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2One() -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Add(v1: Vector2, v2: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2AddValue(v: Vector2, add: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Subtract(v1: Vector2, v2: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2SubtractValue(v: Vector2, sub: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Length(v: Vector2) -> f32;
}
unsafe extern "C" {
    pub fn Vector2LengthSqr(v: Vector2) -> f32;
}
unsafe extern "C" {
    pub fn Vector2DotProduct(v1: Vector2, v2: Vector2) -> f32;
}
unsafe extern "C" {
    pub fn Vector2CrossProduct(v1: Vector2, v2: Vector2) -> f32;
}
unsafe extern "C" {
    pub fn Vector2Distance(v1: Vector2, v2: Vector2) -> f32;
}
unsafe extern "C" {
    pub fn Vector2DistanceSqr(v1: Vector2, v2: Vector2) -> f32;
}
unsafe extern "C" {
    pub fn Vector2Angle(v1: Vector2, v2: Vector2) -> f32;
}
unsafe extern "C" {
    pub fn Vector2LineAngle(start: Vector2, end: Vector2) -> f32;
}
unsafe extern "C" {
    pub fn Vector2Scale(v: Vector2, scale: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Multiply(v1: Vector2, v2: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Negate(v: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Divide(v1: Vector2, v2: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Normalize(v: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Transform(v: Vector2, mat: Matrix) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Lerp(v1: Vector2, v2: Vector2, amount: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Reflect(v: Vector2, normal: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Min(v1: Vector2, v2: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Max(v1: Vector2, v2: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Rotate(v: Vector2, angle: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2MoveTowards(v: Vector2, target: Vector2, maxDistance: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Invert(v: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Clamp(v: Vector2, min: Vector2, max: Vector2) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2ClampValue(v: Vector2, min: f32, max: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector2Equals(p: Vector2, q: Vector2) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Vector2Refract(v: Vector2, n: Vector2, r: f32) -> Vector2;
}
unsafe extern "C" {
    pub fn Vector3Zero() -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3One() -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Add(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3AddValue(v: Vector3, add: f32) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Subtract(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3SubtractValue(v: Vector3, sub: f32) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Scale(v: Vector3, scalar: f32) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Multiply(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3CrossProduct(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Perpendicular(v: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Length(v: Vector3) -> f32;
}
unsafe extern "C" {
    pub fn Vector3LengthSqr(v: Vector3) -> f32;
}
unsafe extern "C" {
    pub fn Vector3DotProduct(v1: Vector3, v2: Vector3) -> f32;
}
unsafe extern "C" {
    pub fn Vector3Distance(v1: Vector3, v2: Vector3) -> f32;
}
unsafe extern "C" {
    pub fn Vector3DistanceSqr(v1: Vector3, v2: Vector3) -> f32;
}
unsafe extern "C" {
    pub fn Vector3Angle(v1: Vector3, v2: Vector3) -> f32;
}
unsafe extern "C" {
    pub fn Vector3Negate(v: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Divide(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Normalize(v: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Project(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Reject(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3OrthoNormalize(v1: *mut Vector3, v2: *mut Vector3);
}
unsafe extern "C" {
    pub fn Vector3Transform(v: Vector3, mat: Matrix) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3RotateByQuaternion(v: Vector3, q: Quaternion) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3RotateByAxisAngle(v: Vector3, axis: Vector3, angle: f32) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3MoveTowards(v: Vector3, target: Vector3, maxDistance: f32) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Lerp(v1: Vector3, v2: Vector3, amount: f32) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3CubicHermite(
        v1: Vector3,
        tangent1: Vector3,
        v2: Vector3,
        tangent2: Vector3,
        amount: f32,
    ) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Reflect(v: Vector3, normal: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Min(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Max(v1: Vector3, v2: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Barycenter(p: Vector3, a: Vector3, b: Vector3, c: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Unproject(source: Vector3, projection: Matrix, view: Matrix) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3ToFloatV(v: Vector3) -> float3;
}
unsafe extern "C" {
    pub fn Vector3Invert(v: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Clamp(v: Vector3, min: Vector3, max: Vector3) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3ClampValue(v: Vector3, min: f32, max: f32) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector3Equals(p: Vector3, q: Vector3) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Vector3Refract(v: Vector3, n: Vector3, r: f32) -> Vector3;
}
unsafe extern "C" {
    pub fn Vector4Zero() -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4One() -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Add(v1: Vector4, v2: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4AddValue(v: Vector4, add: f32) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Subtract(v1: Vector4, v2: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4SubtractValue(v: Vector4, add: f32) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Length(v: Vector4) -> f32;
}
unsafe extern "C" {
    pub fn Vector4LengthSqr(v: Vector4) -> f32;
}
unsafe extern "C" {
    pub fn Vector4DotProduct(v1: Vector4, v2: Vector4) -> f32;
}
unsafe extern "C" {
    pub fn Vector4Distance(v1: Vector4, v2: Vector4) -> f32;
}
unsafe extern "C" {
    pub fn Vector4DistanceSqr(v1: Vector4, v2: Vector4) -> f32;
}
unsafe extern "C" {
    pub fn Vector4Scale(v: Vector4, scale: f32) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Multiply(v1: Vector4, v2: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Negate(v: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Divide(v1: Vector4, v2: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Normalize(v: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Min(v1: Vector4, v2: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Max(v1: Vector4, v2: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Lerp(v1: Vector4, v2: Vector4, amount: f32) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4MoveTowards(v: Vector4, target: Vector4, maxDistance: f32) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Invert(v: Vector4) -> Vector4;
}
unsafe extern "C" {
    pub fn Vector4Equals(p: Vector4, q: Vector4) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn MatrixDeterminant(mat: Matrix) -> f32;
}
unsafe extern "C" {
    pub fn MatrixTrace(mat: Matrix) -> f32;
}
unsafe extern "C" {
    pub fn MatrixTranspose(mat: Matrix) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixInvert(mat: Matrix) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixIdentity() -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixAdd(left: Matrix, right: Matrix) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixSubtract(left: Matrix, right: Matrix) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixMultiply(left: Matrix, right: Matrix) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixMultiplyValue(left: Matrix, value: f32) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixTranslate(x: f32, y: f32, z: f32) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixRotate(axis: Vector3, angle: f32) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixRotateX(angle: f32) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixRotateY(angle: f32) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixRotateZ(angle: f32) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixRotateXYZ(angle: Vector3) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixRotateZYX(angle: Vector3) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixScale(x: f32, y: f32, z: f32) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixFrustum(
        left: f64,
        right: f64,
        bottom: f64,
        top: f64,
        nearPlane: f64,
        farPlane: f64,
    ) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixPerspective(fovY: f64, aspect: f64, nearPlane: f64, farPlane: f64) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixOrtho(
        left: f64,
        right: f64,
        bottom: f64,
        top: f64,
        nearPlane: f64,
        farPlane: f64,
    ) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixLookAt(eye: Vector3, target: Vector3, up: Vector3) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixToFloatV(mat: Matrix) -> float16;
}
unsafe extern "C" {
    pub fn QuaternionAdd(q1: Quaternion, q2: Quaternion) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionAddValue(q: Quaternion, add: f32) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionSubtract(q1: Quaternion, q2: Quaternion) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionSubtractValue(q: Quaternion, sub: f32) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionIdentity() -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionLength(q: Quaternion) -> f32;
}
unsafe extern "C" {
    pub fn QuaternionNormalize(q: Quaternion) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionInvert(q: Quaternion) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionMultiply(q1: Quaternion, q2: Quaternion) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionScale(q: Quaternion, mul: f32) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionDivide(q1: Quaternion, q2: Quaternion) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionLerp(q1: Quaternion, q2: Quaternion, amount: f32) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionNlerp(q1: Quaternion, q2: Quaternion, amount: f32) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionSlerp(q1: Quaternion, q2: Quaternion, amount: f32) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionCubicHermiteSpline(
        q1: Quaternion,
        outTangent1: Quaternion,
        q2: Quaternion,
        inTangent2: Quaternion,
        t: f32,
    ) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionFromVector3ToVector3(from: Vector3, to: Vector3) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionFromMatrix(mat: Matrix) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionToMatrix(q: Quaternion) -> Matrix;
}
unsafe extern "C" {
    pub fn QuaternionFromAxisAngle(axis: Vector3, angle: f32) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionToAxisAngle(q: Quaternion, outAxis: *mut Vector3, outAngle: *mut f32);
}
unsafe extern "C" {
    pub fn QuaternionFromEuler(pitch: f32, yaw: f32, roll: f32) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionToEuler(q: Quaternion) -> Vector3;
}
unsafe extern "C" {
    pub fn QuaternionTransform(q: Quaternion, mat: Matrix) -> Quaternion;
}
unsafe extern "C" {
    pub fn QuaternionEquals(p: Quaternion, q: Quaternion) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn MatrixCompose(translation: Vector3, rotation: Quaternion, scale: Vector3) -> Matrix;
}
unsafe extern "C" {
    pub fn MatrixDecompose(
        mat: Matrix,
        translation: *mut Vector3,
        rotation: *mut Quaternion,
        scale: *mut Vector3,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct rlVertexBuffer {
    pub elementCount: ::core::ffi::c_int,
    pub vertices: *mut f32,
    pub texcoords: *mut f32,
    pub normals: *mut f32,
    pub colors: *mut ::core::ffi::c_uchar,
    pub indices: *mut ::core::ffi::c_uint,
    pub vaoId: ::core::ffi::c_uint,
    pub vboId: [::core::ffi::c_uint; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlVertexBuffer"][::core::mem::size_of::<rlVertexBuffer>() - 72usize];
    ["Alignment of rlVertexBuffer"][::core::mem::align_of::<rlVertexBuffer>() - 8usize];
    ["Offset of field: rlVertexBuffer::elementCount"]
        [::core::mem::offset_of!(rlVertexBuffer, elementCount) - 0usize];
    ["Offset of field: rlVertexBuffer::vertices"]
        [::core::mem::offset_of!(rlVertexBuffer, vertices) - 8usize];
    ["Offset of field: rlVertexBuffer::texcoords"]
        [::core::mem::offset_of!(rlVertexBuffer, texcoords) - 16usize];
    ["Offset of field: rlVertexBuffer::normals"]
        [::core::mem::offset_of!(rlVertexBuffer, normals) - 24usize];
    ["Offset of field: rlVertexBuffer::colors"]
        [::core::mem::offset_of!(rlVertexBuffer, colors) - 32usize];
    ["Offset of field: rlVertexBuffer::indices"]
        [::core::mem::offset_of!(rlVertexBuffer, indices) - 40usize];
    ["Offset of field: rlVertexBuffer::vaoId"]
        [::core::mem::offset_of!(rlVertexBuffer, vaoId) - 48usize];
    ["Offset of field: rlVertexBuffer::vboId"]
        [::core::mem::offset_of!(rlVertexBuffer, vboId) - 52usize];
};
impl Default for rlVertexBuffer {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct rlDrawCall {
    pub mode: ::core::ffi::c_int,
    pub vertexCount: ::core::ffi::c_int,
    pub vertexAlignment: ::core::ffi::c_int,
    pub textureId: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlDrawCall"][::core::mem::size_of::<rlDrawCall>() - 16usize];
    ["Alignment of rlDrawCall"][::core::mem::align_of::<rlDrawCall>() - 4usize];
    ["Offset of field: rlDrawCall::mode"][::core::mem::offset_of!(rlDrawCall, mode) - 0usize];
    ["Offset of field: rlDrawCall::vertexCount"]
        [::core::mem::offset_of!(rlDrawCall, vertexCount) - 4usize];
    ["Offset of field: rlDrawCall::vertexAlignment"]
        [::core::mem::offset_of!(rlDrawCall, vertexAlignment) - 8usize];
    ["Offset of field: rlDrawCall::textureId"]
        [::core::mem::offset_of!(rlDrawCall, textureId) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct rlRenderBatch {
    pub bufferCount: ::core::ffi::c_int,
    pub currentBuffer: ::core::ffi::c_int,
    pub vertexBuffer: *mut rlVertexBuffer,
    pub draws: *mut rlDrawCall,
    pub drawCounter: ::core::ffi::c_int,
    pub currentDepth: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlRenderBatch"][::core::mem::size_of::<rlRenderBatch>() - 32usize];
    ["Alignment of rlRenderBatch"][::core::mem::align_of::<rlRenderBatch>() - 8usize];
    ["Offset of field: rlRenderBatch::bufferCount"]
        [::core::mem::offset_of!(rlRenderBatch, bufferCount) - 0usize];
    ["Offset of field: rlRenderBatch::currentBuffer"]
        [::core::mem::offset_of!(rlRenderBatch, currentBuffer) - 4usize];
    ["Offset of field: rlRenderBatch::vertexBuffer"]
        [::core::mem::offset_of!(rlRenderBatch, vertexBuffer) - 8usize];
    ["Offset of field: rlRenderBatch::draws"]
        [::core::mem::offset_of!(rlRenderBatch, draws) - 16usize];
    ["Offset of field: rlRenderBatch::drawCounter"]
        [::core::mem::offset_of!(rlRenderBatch, drawCounter) - 24usize];
    ["Offset of field: rlRenderBatch::currentDepth"]
        [::core::mem::offset_of!(rlRenderBatch, currentDepth) - 28usize];
};
impl Default for rlRenderBatch {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rlGlVersion {
    RL_OPENGL_SOFTWARE = 0,
    RL_OPENGL_11 = 1,
    RL_OPENGL_21 = 2,
    RL_OPENGL_33 = 3,
    RL_OPENGL_43 = 4,
    RL_OPENGL_ES_20 = 5,
    RL_OPENGL_ES_30 = 6,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rlTraceLogLevel {
    RL_LOG_ALL = 0,
    RL_LOG_TRACE = 1,
    RL_LOG_DEBUG = 2,
    RL_LOG_INFO = 3,
    RL_LOG_WARNING = 4,
    RL_LOG_ERROR = 5,
    RL_LOG_FATAL = 6,
    RL_LOG_NONE = 7,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rlPixelFormat {
